{
  "clusters": [
    {
      "cluster": 0,
      "size": 42,
      "top_terms": [
        [
          "know",
          0.11850396688333888
        ],
        [
          "like",
          0.10061095029442131
        ],
        [
          "don know",
          0.07519272198020166
        ],
        [
          "don",
          0.07002735806015212
        ],
        [
          "just",
          0.06579695234580928
        ],
        [
          "preference",
          0.0636313759860528
        ],
        [
          "different",
          0.04989366988894438
        ],
        [
          "headphones",
          0.047292539366877
        ],
        [
          "people",
          0.03711266883138698
        ],
        [
          "bass",
          0.03330729025385183
        ],
        [
          "sound",
          0.03270830104975111
        ],
        [
          "want",
          0.03200899920676456
        ],
        [
          "better",
          0.031999656574286564
        ],
        [
          "just don",
          0.0312384955138665
        ],
        [
          "prefer",
          0.030496592742020722
        ]
      ],
      "representatives": [
        {
          "name": "t1_n7h2xir",
          "subreddit": "headphones",
          "body": "Have both (and room full of others😅). Remember it's all about personal preference, hearing, HRTF etc, but my personal take about the 7506's is that they sound grainy and mostly unfit for music while FT1 is tour de force giant killer that makes two dozen headphones up to like $1000 irrelevant🤣\n\nSome people like DMS really like the 7506 and certainly we can actually be hearing very different things. Just today I really wanted to listen the FT1's, but couldn't find them🙈"
        },
        {
          "name": "t1_n15b77k",
          "subreddit": "headphones",
          "body": "Okay, I genuinely want to know what exactly you didn’t like about FT1 - were they too muffled for you. I need to know from your point of view, so I understand better that big preference difference."
        },
        {
          "name": "t1_myuhlpl",
          "subreddit": "headphones",
          "body": "My FT1 Pro will arrive tomorrow and I'm so glad to find your EQ suggestion here. My only issue now is I don't know for sure if my Topping DX1 can handle these, especially with -3.9dB preamp."
        },
        {
          "name": "t1_mzp1lvh",
          "subreddit": "headphones",
          "body": "$430 - Building around the HiBy R6 III DAP - Need more power later? This can still be your Streamer and DAC. Want to use your computer as a source? This can be the DAC and amp. Need more power and to use a different source? This can just be the DAC. Other than Upgrades to the R6, I don't know of a more versatile device.\n\n$270 - HiFiman Edition XS - Excellent entry level Planar that is efficient enough to run off the R6 and really enjoy it. Gives you an Open back option.\n\n$165 - Fiio FT1 - Closed back dynamic driver that slams. SLAMS I SAY!\n\n$80 - Moondrop Aria 2 - Since you have a DAP, you need a competent IEM for walking around and the synergy between these two are phenomenal. I know that there are other options in the $80 or less range that some prefer, but the Aria 2 runs insanely well with the R6 III.\n\n$40 - Koss KPH40 + $12 Yaxi replacement earpads - if you don't know then you need to know.\n\n$430 + $270 + $165 + $80 + $40 + $12 = $997.\n\nDo I win?"
        },
        {
          "name": "t1_n1od6na",
          "subreddit": "headphones",
          "body": "Yeah i would not bet on getting something truly great at that pricerange. That is why we have several headphones to begin with. There isnt much left for you to try that is open back aside from all the chifi brands that i dont know the names of.\n\n\nthe fiio ft1 pro is around 200.\nThe audio trchnic r50x is around 150,i dunno its tuning tho."
        }
      ]
    },
    {
      "cluster": 1,
      "size": 327,
      "top_terms": [
        [
          "headphones",
          0.02448248378428206
        ],
        [
          "got",
          0.021827624487351996
        ],
        [
          "like",
          0.0185329997610414
        ],
        [
          "just",
          0.017995727642600934
        ],
        [
          "good",
          0.01621866043175516
        ],
        [
          "use",
          0.015080306612441138
        ],
        [
          "ve",
          0.01406111518318164
        ],
        [
          "bought",
          0.01352589073402646
        ],
        [
          "pros",
          0.013521541828027811
        ],
        [
          "price",
          0.01339813195604874
        ],
        [
          "probably",
          0.012860909332792686
        ],
        [
          "love",
          0.012763883784110369
        ],
        [
          "iems",
          0.01270679770267817
        ],
        [
          "sound",
          0.012598883514818424
        ],
        [
          "thanks",
          0.01253628077430408
        ]
      ],
      "representatives": [
        {
          "name": "t1_n76xth7",
          "subreddit": "headphones",
          "body": "Fiio FT1"
        },
        {
          "name": "t1_n2af2k7",
          "subreddit": "PcBuild",
          "body": "https://pcpartpicker.com/product/t3Jp99/msi-mag-27cq6f-270-2560-x-1440-180-hz-curved-monitor-27cq6f\n\nhttps://pcpartpicker.com/product/BycgXL/asus-tuf-gaming-vg27aqa1a-270-2560-x-1440-170-hz-monitor-tuf-gaming-vg27aqa1a\n\nhttps://pcpartpicker.com/product/LfzXsY/asrock-pg27qft1b-270-2560-x-1440-180-hz-monitor-pg27qft1b"
        },
        {
          "name": "t1_n4ts7ix",
          "subreddit": "headphones",
          "body": "FT1 Fiio"
        },
        {
          "name": "t1_n4bbs5m",
          "subreddit": "headphones",
          "body": "Get FIIO Ft1 gng"
        },
        {
          "name": "t1_n2irrzq",
          "subreddit": "headphones",
          "body": "FiiO FT1"
        }
      ]
    },
    {
      "cluster": 2,
      "size": 194,
      "top_terms": [
        [
          "bass",
          0.07212320206662709
        ],
        [
          "sound",
          0.06367374535048725
        ],
        [
          "closed",
          0.05696960050262768
        ],
        [
          "good",
          0.05192478616976035
        ],
        [
          "headphones",
          0.05046555117926057
        ],
        [
          "better",
          0.04607778212023805
        ],
        [
          "like",
          0.04572836628609087
        ],
        [
          "it",
          0.045387912344658325
        ],
        [
          "backs",
          0.04475430048108644
        ],
        [
          "just",
          0.041214393324355475
        ],
        [
          "open",
          0.03787679643055841
        ],
        [
          "headphone",
          0.03710779658547774
        ],
        [
          "re",
          0.03417179745006377
        ],
        [
          "want",
          0.031039117532919835
        ],
        [
          "great",
          0.03071949438998876
        ]
      ],
      "representatives": [
        {
          "name": "t1_n2f66ey",
          "subreddit": "headphones",
          "body": "Got mine this week as well. Only other pair of decent headphones I own are Sundaras.  The bass from the FT1s is brilliant, not as tight as the Sundaras but has more body to it without losing control. The quality in the mids and trebs is good but not as good as the Sundaras but that's to be expected.\n\nYou get some good imaging and sense of space, no issues with hotspots but I have a small head, and I can wear them for hours. Even though they are only about 30g lighter than the Sundaras I feel much more comfortable using the FT1s away from my desk/chilling in bed.\n\nBeyond that, whereas I have to EQ the sundaras to get the sound profile im looking for, the FT1s sound brilliant right out of the box. Eq'ing no doubt will only improve them, it's just not necessary like it is with the Sundaras.\n\nI reckon the Sundaras will be my critical listening phones until I upgrade to Aryas/HE1000, and the FT1s will be my everyday go to. I was initially worried that they would be unnecessary against the Sundies but they complement each other nicely for my purposes and the sound quality is excellent for the price. I never looked at the FT1s as an upgrade option but as something to offer a different experience and I've been really happy with them in that regard.\n\nLooking at it from a cost/performance perspective, I bought an amp/dac for the sundies and so total cost was around £400, whereas the FT1s could be powered by my left foot so if you're just getting into headphones you really can't beat these."
        },
        {
          "name": "t3_1m3wejy",
          "subreddit": "headphones",
          "body": "Ultimate Over-ear Headphones Recommendations List\nMade by Sergey Gudkov, translated by GloWer\n\n# [Links on other lists](https://pastes.dev/rWFwvubMJ9)\n\n# [Guides and FAQ](https://pastes.dev/SVN4CIxxU4)\n\nLast Update: May 27, 2025\n\n**Before you start reading the recommendations list, I strongly advise reading the disclaimers first – they cover all key aspects discussed in this guide.**  \n\nDISCLAIMER:\n\n# I am not the ultimate authority in the audio. If you want to figure everything all by yourself and truly understand audio - read [AES researches](https://aes2.org/aes-membership-overview/), learn physics, try to experiment and understand how audio works.\n\nIf you don't use equalization, believe in miracles and myths about audio (like cables affecting sound, burn-in, or even the different sound signatures of different DACs), then this guide isn't for you. Listen for yourself, and then decide what you need, or what you don't. With that approach, author has already fucked up tens of thousands of dollars and realised, that this kind of approach is bullshit.\n\nHowever, objective independent measurements and sound correction with equalization - work flawlessly.\n\nGuide's purpose - recommend audio equipment that will allow you to achieve Hi-Fi audio quality (a real audio term that is not a made up audiophile dogshit like “airy soundstage” and “springy bass”) at ANY price point. Essentially, I propose not dividing audio equipment into price brackets and “tiers”, because it's basically full of hype and marketing. \n\nPrice brackets below are provided merely for your convenience in choosing audio gear within your budget, not to show that one thing is necessarily better than the other.\n\n🌟 - **this symbol shows** audio equipment, that I keep in my collection, but even then they can have some issues, and after the correction they sound better\n\n**If you're looking for the most neutral sound without any major flaws in their stock form (although even they can sound better after sound correction)**, the choice is simple: Dan Clark Audio Noire X and Stealth. These are marked with 🌟🌟🌟.\n\nDISCLAIMER #2 (Equalization):\n\nNearly all headphones in this list are meant to be used with EQ, because 99.99% of headphones have objective flaws (this list simply collects the least problematic ones or the most responsive to EQ).  \n\nAnd let's not forget: your own ear resonances will create peaks in the FR where certain frequencies scream louder than others - while someone else might not hear those peaks at all. If you don't manually correct this, it'll affect sound quality.  \n\nI'm not even mentioning channel imbalance - it's almost always present too. This also needs correction, but requires more nuanced, ear-trained EQ adjustments. Best tackled with some prior EQ experience.  \n\n**What should I use as a reference in over-ear headphones?**\n\nThe answer is not simple, and probably won’t be definitive.**In my opinion**, the truth lies somewhere between these approaches:\n\n* EQ to Harman OE2018 via [Oratory’s measurements](https://github.com/jaakkopasanen/AutoEq/tree/master/measurements/oratory1990/data/over-ear), or through [his EQ database](https://www.reddit.com/r/oratory1990/wiki/index/list_of_presets/).\n* EQ to Diffuse Field 0Tilt +8dB bass using 5128 measurements.\n* If you have neither Oratory’s measurements, nor 5128 measurements, try EQing to Harman 2018 via trusted measurers, such as [Unheard Lab](https://sai.squig.link/?share=Harman_OE_2018_Target), [boizoff](https://boizoff.squig.link/headphones/?share=Harman_2018_(for_KB501X)_Target), [Kuulokenurkka](https://kuulokenurkka.squig.link/?share=Harman_2018_Target), etc.\n\n**Why multiple approaches?** I don't own a measurement rig for over-ear headphones, so I can't definitively say why sometimes my headphones sounded closest to a flat audio system with the first EQ method, sometimes the second, and sometimes terrible with both. The probable reasons were either the unit variation of the headphones themselves, which made it impossible for me to set them up properly, or the interaction between the headphones and my head. Likely due to nuances of headphones fitting on my head, the final FR differs completely from rig measurements, requiring different correction. (Headphones Show covers this in [their HPTF video](https://www.youtube.com/watch?v=Km2DNLbB-6o) \\- don't confuse it with HRTF).\n\nSo I recommend trying all 3 EQ approaches if possible, then improve each by adjusting bass/treble shelves to taste and finding peaks/dips by ear. This isn't a one-session job - I typically need multiple sessions over a week to make EQ as perfect as possible to my preferences. For example, I might nuke a nasty 10kHz peak with a -6dB Peak filter, only to realize days later that everything sounds too muffled, and backing off to -2dB suddenly clicks.  \n\n# Wired Open-Back headphones\n\n# Under $100:\n\n🌟 [**Philips SHP9500**](https://gadgetrytech.squig.link/headsets/?share=Philips_SHP9500) **($65)** — The comfort kings in the budget segment. Stock tuning shouts painfully at 6kHz and has no sub-bass whatsoever. Super lightweight and comfortable. Comes with [Oratory's EQ preset](https://www.dropbox.com/scl/fi/z27ma1jviiontwrph5bwu/Philips-SHP9500.pdf?rlkey=ghpvwjvsliivy2o19jkde5lue&dl=0). Also has [5128 measurements](https://drive.google.com/file/d/11Lv2WmqhM5Zn2DCiT4-1pZ_yXnmhSxAw/view?usp=sharing) and [my EQ profile](https://drive.google.com/file/d/1IPYTkDq1mmDysEgG98Ketg6zESKloTkW/view?usp=sharing) based on these measurements, that makes them sound great. Starred recommendation because they're only worth using with EQ. Bass has quite a bit of distortion but I don't hear it after my EQ. My threshold is pretty high here. Might not be the same for you, so if you can clearly hear distortion in music, don't get these.\n\n[**Hifiman HE400se v1 ($95)**](https://boizoff.squig.link/headphones/?share=Harman_2018_(for_KB501X)_Target,HE400se_V1_(stock_pads)) — Decent stock FR but they are heavy, headband presses on the head (those who bothered could mod it for comfort, congrats if stock feels comfy for you). Oratory's database has an [EQ preset](https://www.dropbox.com/scl/fi/56mhymqxodfx5ql28mvs2/Hifiman-HE400se.pdf?rlkey=0uxjjoidaizbcy19e4ngr87rv&dl=0). Low distortion lets you add proper bass. V2 is fine too, but only at a similar \\~$100 price. No reason to overpay - they sound the same. If you get lucky with comfort, these might be your only over-ear headphones needed. Just tweak the bass to your taste and you're good to go. \n\nUnder $300:\n\n[**Sennheiser HD560s**](https://listener.squig.link/5128/?share=Custom_Tilt,HD560S&bass=8&tilt=0&treble=0&ear=0) **|** [**HD58X**](https://sai.squig.link/?share=Harman_OE_2018_Target,x_Drop_HD58X) **|** [**HD600**](https://listener.squig.link/5128/?share=Custom_Tilt,HD600&bass=8&tilt=0&treble=0&ear=0) **|** [**HD650**](https://listener.squig.link/5128/?share=Custom_Tilt,HD650&bass=8&tilt=0&treble=0&ear=0) **|** [**HD6XX**](https://listener.squig.link/5128/?share=Custom_Tilt,HD_6XX&bass=8&tilt=0&treble=0&ear=0) **($150-300)** \\- Lightweight headphones with decent stock FR. [Oratory's EQ presets](https://www.reddit.com/r/oratory1990/wiki/index/list_of_presets/) are available, plus multiple measurement rig data for custom EQ. Like most Sennheisers - lacks sub-bass stock and has noticeable distortion in that region.   \nComfort-wise: HD560s feel a bit stiff. Others are super comfortable but pricier. Personally, I'd take EQ'd SHP9500 over these for better comfort/price ratio, or jump straight to Fiio FT3 350 Ohm or HD490 Pro.   \nIf you already own these - just EQ them and test if you can hear bass distortion at your normal listening levels with your music. No need to upgrade immediately.\n\n[**Hifiman Sundara Open**](https://listener.squig.link/5128/?share=Custom_Tilt,Sundara&bass=8&tilt=0&treble=0&ear=0) **($230)** \\- Solid Harman OE2018 match in stock. Measures slightly flatter than HE400se. A bit more comfortable headband, slightly lighter weight. [Oratory's EQ preset](https://www.dropbox.com/scl/fi/an302wslesyifej76sa6x/Hifiman-Sundara-2020-revised-earpads.pdf?rlkey=8tv01b47ewrqeh2k99btkcdhw&e=1&dl=0) available. Takes bass EQ well.    \nClamp force is noticeable at the sides. Same Hifiman \"reflection\" artifact as HE400se (not everyone hears it in music).  \n\n[**Fiio FT3 350 Ohm**](https://vsg.squig.link/headphones/?share=Harman_2018_Target,FiiO_FT3_pleather) **($230)** — Comfortable, lightweight, and with a funny (to my taste) design. Don't confuse them with the 32 Ohm version – that one's worse. Comes with [Oratory's EQ preset](https://www.dropbox.com/scl/fi/vqn9yh7wybqcqc5kitxfi/Fiio-FT3-pleather-earpads.pdf?rlkey=qzqt4sfwhgb7zfyankgnq7ydz&e=1&dl=0). Pretty decent stock frequency response, just needs a slight mid-bass taming (though some might find it fine as it is). Sound-wise, they're solid. Some users with larger ears complained they don't fit inside the earcups. \n\n# Open-Backs for $300 or more:\n\n🌟 [**Sennheiser HD490 Pro**](https://listener.squig.link/5128/?share=Custom_Tilt,HD490ProMixing&bass=8&tilt=0&treble=0&ear=0) **($400)** — If you need comfortable open-backs but neither Philips SHP9500 and FiiO FT3 350 Ohm are not good enough, get these. Measurements are more than okay. With EQ, they'll sound absolutely fantastic. Comfort-wise: absolute blessing.  \n\n[**Sennheiser HD800S**](https://listener.squig.link/5128/?share=Custom_Tilt,HD800S&bass=8&tilt=0&treble=0&ear=0) **($2000)** \\- Headphones for OLDiophiles. Their soundstage is quite a unique experience. Don't know if it's the FR, driver size, channel matching, cup volume or all combined, but it's legit fun. Lightweight, comfy, good QC, [Oratory preset](https://www.dropbox.com/scl/fi/ytqtyrtwwi6qav85163lc/Sennheiser-HD800S.pdf?rlkey=k0ajx8zzn2x046ausf94tcp5f&e=1&dl=0) available.    \nStandard Sennheiser moments though: bass distortion + stock sub-bass deficiency means you'll need to EQ them. Boosting lows will amplify distortion too. Not necessarily bad (many won't hear it), but golden-eared folks will notice it.    \nStock tuning can shriek in treble, and FR isn't ideal. HD560s, HD650, Sundaras or FT3 measure flatter right out of the box. So these are essentially expensive headphones with a funny gimmick and excellent QC. Also: gigantic cups for elephant ears. Surprisingly light.\n\n[**Dan Clark Audio Noire XO**](https://www.audiosciencereview.com/forum/index.php?threads/dan-clark-noire-xo-headphone-review.62779/) **($1000)** — Basically a Dan Clark Expanse, but for $1K instead of $4K. Low distortion at 94dB (don’t listen louder unless you wanna fuck up your hearing). Solid stock FR. Looks absolutely stunning.  Honestly, I can’t decide if I’d pick these, the Aryas, or the Sennheisers. But they’re too good not to mention.  \n\n[**Hifiman Arya Unveiled**](https://kuulokenurkka.squig.link/?share=Harman_2018_Target,Arya_Unveiled_**) **($1500)** — Finally, a Hifiman without that damn reflection artifact. The FR is relatively flat. A bit of EQ and it's basically endgame material.    \nWhat’s the catch? The planar driver is completely exposed on the outer side. A metal speck or some other crap gets in - goodbye $1.5K. But these are legit unique – no major dips or peaks, making EQ and overall sound quality a breeze.  \n\n[**Audeze LCD-5**](https://listener800.github.io/5128.html?share=5128_DF_Target,LCD-5&bass=8&tilt=0&treble=0&ear=0) **($4500)** — I genuinely don't understand why you'd buy these when you could build a banger Hi-Fi system for the same cash. With that being said, their FR is stupidly easy to EQ. Stock tuning's kinda wack though.  \n\n# Wired Closed-Back headphones\n\n# Under $150:\n\n[**FiiO JT1**](https://sai.squig.link/?share=Harman_OE_2018_Target,x_Jade_Audio_JT1) **($70)** — Lightweight, plastic creaks and cracks a bit. But the overall build quality seems decent. Treble is super smooth on my head. FR shows tons of bass, but since the seal isn't tight, it leaks - resulting in fun, slightly bassy headphones with surprisingly even and pleasant highs. Isolation's weak for closed-backs. Imagine this sound in FT1's housing - would've been an absolute bang for a buck.\n\n🌟 [**Fiio FT1**](https://sai.squig.link/?share=Harman_OE_2018_Target,FT1) **($150)** — Good accessories, moderate weight (340g). Pretty Comfortable. Stock treble isn't great - has peaks/dips, but after EQ they sound excellent. Without EQ, they're overly bassy; with EQ - superb. Solid noise isolation. Many dislike their sound even after EQ. Here's the thing: this is the fundamental issue with full-size closed-backs - sound varies drastically based on head shape and seal quality. Consistency is a myth here. Doesn't matter if they cost $100 or $1000+ - closed-back consistency sucks ass across the board.  \n\n[**AKG K361**](https://kuulokenurkka.squig.link/?share=K361_**)**/**[**K371**](https://listener.squig.link/5128/?share=Custom_Tilt,K371&bass=8&tilt=0&treble=0&ear=0) **($100-150)** \\- Not the most reliable or sturdy pair of headphones, but quite lightweight and comfortable. Has Oratory's EQ presets for both [K361](https://www.dropbox.com/scl/fi/3e7ri4r4h7v9ddjmjln7p/AKG-K361.pdf?rlkey=493qy3qtn7kt9pe873c3lu7xl&e=1&dl=0) and [K371](https://www.dropbox.com/scl/fi/ovojvk3yezusykla93r2y/AKG-K371.pdf?rlkey=g361hgy71zpgyp4l428s2yyik&e=1&dl=0). If it weren't for the construction and build quality, they'd be absolute top-tier. They're only here in case you already own them or someone offers them to you super cheap in good condition. In all other cases, I'd choose to buy a new FiiO FT1 for $150.\n\n# Closed-Backs for a Shit Ton of Money:\n\n[**Dan Clark Aeon Closed X**](https://sai.squig.link/?share=Harman_OE_2018_Target,Aeon_Closed_X) **($500)** — DCA's most budget-friendly pair of headphones. Stock tuning might have too much treble or too little bass. Comes with [Oratory's EQ preset](https://www.dropbox.com/scl/fi/ecj3xh89xo25vetc0r0zg/Dan-Clark-Audio-Aeon-X-Closed.pdf?rlkey=menevi1a6rjk717zse3l8r5n9&e=1&dl=0). Lightweight, comfy, decent isolation. After EQ - easily one of the best closed-backs out there.\n\n[**Dan Clark Aeon Noire 2**](https://www.audiosciencereview.com/forum/index.php?threads/dan-clark-audio-aeon-2-noire-review.46055/) **($900)** — Also lightweight, FR slightly flatter than Aeon Closed X, but otherwise pretty much the same, though these fold up neatly. Comes with [Oratory's preset](https://www.dropbox.com/scl/fi/s5c1q0wjku9gy1bwr8p90/Dan-Clark-Audio-Aeon-2-Noire.pdf?rlkey=5rj5zcbbxbdzt3ghv6tjxpj9j&e=1&dl=0). \n\n🌟🌟🌟 [**Dan Clark Noire X**](https://www.audiosciencereview.com/forum/index.php?threads/dan-clark-noire-x-headphone-review.58795/) **($1000)** — Absolutely insane stock FR. For those seeking closed-backs to use with no EQ (if you win the consistency lottery). Nothing meaningful to EQ - maybe just channel balance. Sounds endgame if you don't lose the fit gamble (lucky me - perfect seal/sound). But QC issues plague DCA: fresh units arrive with warped pads, janky cables, FR quirks. Buy at your own risk - but they are just too damn good not to mention.  \n\n🌟🌟🌟 [**Dan Clark Stealth**](https://www.audiosciencereview.com/forum/index.php?threads/dan-clark-stealth-review-state-of-the-art-headphone.25920/) **($4000)** — The best closed-back full-size headphones on the market… if, again, you win the consistency lottery (that’s where sound changes drastically based on head shape. I got lucky - perfect seal and sounds fucking amazing). But they cost $4K… Honestly, if you are ready to spend $4K on a pair of headphones, then it would be better to just get a proper set of monitors and subwoofers from Genelec with room correction, and then grab some Noire X with the change, or even take a vacation to the Maldives lol.\n\n# Wired Headsets (If, for some reason, you absolutely need to buy one)\n\n[**HyperX Cloud Core 1**](https://www.rtings.com/headphones/graph/30567/sound-profile/hyperx-cloud-core/812)**|2 ($20-50)** — Insanely cheap, easy to find on Facebook Market or other second hand markets. The sound ain't great but not complete trash either. If you want better audio, keep looking.  \n\n[**Simgot EP5**](https://sai.squig.link/?share=Harman_OE_2018_Target,EP5) **($100)** — Mic + soundcard version. Sound would be amazing, if not for channel imbalance, so just \"okay\" instead. But as a headset? Actually decent.  \n\n[**Edifier W820NB Plus**](https://filk.squig.link/?share=Harman_OE_2018_Target,Edifier_W820NB_Plus) **($50)** — Yes, they're Bluetooth. But as a headset, you'd use them wired to avoid latency and audio compression. The mic's great for Discord. The stock sound is decent too. Bonus: you get BT headphones with LDAC, ANC, solid sound, and low price. Unconventional pick, but worth trying on a tight budget.  \n\n[**Drop + Sennheiser PC38X**](https://sai.squig.link/?share=Harman_OE_2018_Target,x_Drop_PC38X_with_default_fabric_pads) **($170) /** [**Sennheiser Epos H6 Pro Open**](https://boizoff.squig.link/headphones/?share=Harman_2018_(for_KB501X)_Target,H6_Pro_Open) **($80)**\n\n[**Beyerdynamic MMX100**](https://gadgetrytech.squig.link/headsets/?share=beyerdynamic_MMX_100) **($70)**\n\n# Wireless Headsets\n\n[**Logitech G733**](https://gadgetrytech.squig.link/headsets/?share=Logitech_G733) **($120)** — Super lightweight, the cheapest of the \"barely passable\" options, but still pretty wack sound-wise overall.  \n\n[**Beyerdynamic MMX200**](https://gadgetrytech.squig.link/headsets/?share=Beyerdynamic_MMX_200_Wireless) **($230)** — Solid stock tuning, decent mic, reasonable MSRP.\n\n🌟 [**Audeze Maxwell**](https://kuulokenurkka.squig.link/?share=Maxwell_(Audeze_Preset)_**) **($300)** — Best-in-class sound (for headsets and beyond), but they are SO FUCKING HEAVY AND UNCOMFORTABLE. And worst of all - THEY ARE FRAGILE AS SHIT (planar drivers break from a sneeze, so be really careful with them). Software's janky too. Mic sucks.  \n\n[**SteelSeries Arctis Nova Pro**](https://www.rtings.com/headphones/graph/30567/sound-profile/steelseries-arctis-nova-pro-wireless-pc-ps-xbox/33683?disabled=tests:0:,tests:1:,tests:2:,tests:3:,tests:4:) **($300)** — Banger software. Hot-swappable batteries. Excellent mic. Stock FR isn't great but fixable. Comfy, lightweight, pricey.\n\n[**Logitech Astro A50X**](https://gadgetrytech.squig.link/headsets/?share=Astro_A50X_(Default_EQ)) **($400)** — Better FR than Maxwell, lighter/more comfortable than Maxwell, more reliable than Maxwell, banger mic... but even pricier.    \nThen there's the fucking dock - can't just move it around like Maxwell's dongle. Plus: proprietary USB cable for dock (not sold separately). Cable dies? Congrats, buy new headphones. So... IDK if I can recommend. Decide for yourself. Major pros, major cons.  \n\n[**Logitech Astro A50 Gen5**](https://gadgetrytech.squig.link/headsets/?share=Harman_2018_Target,Astro_A50_Gen_5) **($300)**  — Sound nearly identical to A50X, but $100 cheaper (just -5dB sub-bass vs A50X - who cares when EQ exists?). No video passthrough like A50X's dock, but who actually needs that? Same stupid dock that chains you to one spot though - zero easy device switching across rooms."
        },
        {
          "name": "t1_n3m9wb8",
          "subreddit": "headphones",
          "body": "they are 'burnt-in' during QC and production, it makes absolutely no sense to 'burn in' headphones.\n\nWhat people most likely came to believe was due to your head adjusting to a different sounding headphone.  \nThough only slightly or pads getting worn which DOES change the sound.\n\nFor instance I bought the Fiio FT1Pro recently and I didn't like the veiled treble sound.  \nI daily-drove them for two weeks and after swapping back to my Rode NTH-100's, I instantly decided to return the Fiio's. The Veiled Treble quality and the lack of authentic mid's/bass leave me disappointed.\n\nSo in that way, no amount of 'burn-in' would've helped here."
        },
        {
          "name": "t1_mvjhlu7",
          "subreddit": "headphones",
          "body": "The LCD 2 classic was literally the first high end headphone I ever tried close to 1k dollars. It's one of the worst sounding headphones I've tried. No bass weight, dark, slow, lacking dynamics, classic planar thinness to the sound, but detailed and not harsh. \n\nAll the dynamics I've tried have been much closer to the sound I like. Punchier, snappier, weightier, more engaging, more meat to the sound while still being intricate enough in the details to have nice clarity. \n\nMy current top headphones, out of what I've tried so far in 15 years, are: \nEMU Teaks (closest overall, and still my top main headphone)\n\nDenon 7200 (comes in a very close second, price and comfort were the main issues here)\n\nAudio Technica R70x (whatever was the most recent version. Snappy, engaging sound, good details, smooth treble, tight precise imaging, decent enough bass, but a little dry overall as a whole)\n\nFiio FT1 (a little harsh on treble, lacks detail  in the mids)\n\nHarmonicdyne x Z Reviews Eris (this one surprised me by how much I liked it, the mids are just barely too recessed, and the bass is just barely too boomy, but it's all clean and snappy with good details, no treble issues, and good imaging)\n\nSennheiser HD650 (classic sound, just lacks some bass extension that I'd prefer, but good engagement and smooth treble)\n\nOtherwise the only planar I ever liked was the Mr. Speakers Alpha Prime I used to own. It had the bass I loved, good meat to the sound and mids, with only a minor treble peak causing some issues on certain songs. Plus great imaging and details. Comfort was ok, the cups didn't articulate enough to fit my head perfectly. \n\nAll the other planars I've tried, the LCD 2 classic, the DCA E3, Sundara, all had a thinner lighter sound I didn't enjoy. The Sundara got closest to what I liked, the other two where both similarly lacking dynamics/engagement/too thin and light, but on opposite ends of the tuning spectrum. The E3 is brighter, faster, and tight. While the LCD 2 was darker, muddier, and laid back. I have a Schiit jotunheim and had a magni unity to power everything, so lacking drive wasn't a factor. \n\nI'd love to try every headphone that exists, my experience is only limited to what I could buy and return easily so far. Or sell at a reasonable price. Like I'd love to hear the Meze planars, and the Final Audio flagships. Or give the ZMF Caldera Closed a test run. But all of those are way outside my budget now lol."
        },
        {
          "name": "t3_1l8g5qk",
          "subreddit": "headphones",
          "body": "Takeaways and Tips from Headphone shopping in Akihabara, Tokyo\nRecently I was on a trip to Tokyo and one of my major must-sees was doind some headphone shopping in Akihabara, the tech district of Tokyo. Specifically and especially at E-Earphones and Yodobashi Akiba.\n\nIt's such a dream compared to anywhere in the US. Being able to sample and try thousands of headphones and iem's to your hearts content, something you can't find here. There's plenty of other posts highlighting how great E-Earphones is, so I won't wax poetic about it too much and mostly keep my thoughts to actual headphone impressions that may be useful to some:\n\nI went into E-Earphone willing to spend around $1000, but only if it was the right price, and blew me away. Mostly I wanted the chance to sample things I'd never otherwise get a chance to try, and then find the best price for them.\n\nMy current home setup is a Modhouse Tungsten, which I love, and in order to upgrade from (if its even much of an upgrade) I'd be spending close to $5000+, so open back headphones weren't a concern. For travel and mobile use I have a Focal Bathys and my beloved 7hz Timeless II. My goal was to try to see if I could find a meaningful upgrade from the 7hz Timeless II (I've tried some that were supposed upgrades and always gone back to the Timeless), and to find a pair of closed back wired headphones that were significantly better than my Bathys. I enjoy the Bathys, but they do feel meaningfully worse than my other favorite wired sets, and I wanted something I could listen to when doing things like playing poker or taking the dog for a walk that would be more enjoyable and immersive.\n\nHere's my impressions from some I sampled:\n\n- DCA closed backs were at the top of my list of ones I was interested in, and unfortunately there were no Dan Clark headphones to be found at either E-Earphones or Yodobashi Akiba. I mentioned it to an employee at the shop and they seemed confused, so it seems that DCA doesn't have much of a market in Japan. \n\n- Meze 99 Classics & Fiio FT1: These headphones were right next to each other so I got to do a lot of A/B testing with them. I thought it was a good comparison given they are going for pretty similar use cases, and while the Meze is more expensive, they're both fairly budget friendly. The Fiio embarrassed the Mezes. It was a pretty jarring difference. The Mezes felt dark. Warm, and decent bass, but so dark it felt boring and dull by comparison to the Fiio. With the Fiio I was aware of the hype, but was still shocked at how good they are. The bass lift is perfect for me (I like a lot of bass, and listen to my Tungsten with a decent bass shelf), it's really strong and hits hard, but it doesn't overshadow the mids and highs. It's just a super fun sounding headphone. Meze 99 Classic: ⭐️ Fiio FT1: ⭐️⭐️⭐️⭐️\n\nMeze Liric II: This was my other high-end, closed back hopeful aside from DCA. It didn't disappoint.  Really great clarity, no obvious flaws, and still pretty fun to listen to. I do feel like it's maybe only 10% better than the Fiio FT1, and the price difference between them makes it feel hard to justify. ⭐️⭐️⭐️\n\nStax SR-L500mk2: I had to take an opportunity to listen to an EST, because when else am I going to get the chance? I figure it's different enough from the rest of my collection that if it blew me away I'd spring for it. It didn't. Amazing clarity, but I found it to be not nearly as much fun as some others I sampled. Perhaps I like bass too much. But it isn't something that brought me joy.🤷 ⭐️⭐️\n\nSennheiser HD800s: This wasn't a big contender for actual purchase, but I had to give them a try since they often get brought into discussions of the best airy/soundstage headphones along with some Hifimans I love and my Tungsten, so I had check them out. Very solid, but I was a bit disappointed, because I'm not sure I felt like they felt any wider or more spacious than my Aria Stealth, or the Tungstens, and those both have better low end performance. The Sennys calling card isn't something that is likely to be easily analyzed in just a quick listening session, so I give it a bit of a pass, but I do think the comfort and build is largely where it's advantages lie over something like Hifiman, rather than on sound quality. ⭐️⭐️\n\nB&W Px8: I tried these because they often get compared to my Bathys and I was curious if I'd made the right choice. The Px8's are pretty, and I like the look of them a lot more than the Bathys, but I found them much muddier in sound. They reminded me of Sonys, with overly bloated bass and a veiled sounding midrange. ⭐️\n\nI was sad that they didn't have most of the ZMF closed backs I wanted to try. So I turned my focus to IEM's.\n\nHBB x Kiwi Punch: This thing is a mess.  I love bass, and its so unique so I had to try it. But it's all bass. It's rumbly, but the mids and highs feel absolutely drowned in the bass. The bass also surprisingly didn't feel as high quality as I'd hope, it didn't feel fast, which is hard to explain for an iem that has one job. ⭐️\n\n64Audio Solo: Very impressive. Its hard to find flaws. Everything felt well balanced, and they're small and extremely comfortable. I get why people love 64Audio products, and it seems hard to go wrong. Diminishing returns are real, and I'd say they only felt maybe 20% better than the Timeless II's, but it's definitely a step up and noticeable. ⭐️⭐️⭐️⭐️\n\nSony Z1R IEM: I was pumped to try these, given their reputation for the best bass. I don't get it. The bass is really good, maybe the best I've heard from an iem. But it's very marginal, and the bass overpowers everything. I was expecting they  also likely wouldn't fit comfortably and I was correct. They don't fit my ears. Not only that, but the cable is surprisingly bad and annoying. ⭐️⭐️\n\nSennheiser IE900: These are excellent. They felt similar to the Solo to me, in that there were very, very few flaws to find, and they were very comfortable. I think I slightly prefer them to the Solo. I wanted to do some A/B testing but they were on opposite ends of the floor. ⭐️⭐️⭐️⭐️\n\nDunu DaVinci: I own the Hype 4's, but I find them uncomfortable for long periods and actually prefer the Timeless II. The Hype 4's can be a bit fatiguing and I think the bass is slightly overrated based on other reviews. That said, I wanted to give another \"new meta\" iem a chance. The Hisenior Mega5est was my first option, but I couldn't find them, so I tried the DaVinci. I was very pleasantly surprised. I actually found the bass to be a bit tighter and better than the Hype 4's, and with a much smoother and less fatiguing upper range. Plus they were much more comfortable for me. The nozzle is a little large, but the shells felt better in my ears. The Timeless II feel so fast and resolving in a way that I wouldn't quite say the DaVinci achieves, but the DaVinci is much smoother and the punch/slam of the bass felt more significant. ⭐️⭐️⭐️⭐️\n\n\nIn my experience, when doing price conversions, I was surprised that almost all headphones were more expensive in Tokyo than in the US. Even for Japanese brands. So I thought I would probably not buy anything in E-Earphones for that reason. But I was unaware of how great their used section is. They have two full floors of used products that are graded based on condition and all of them can be sampled. This is where there is some great value. I sampled a few more things but won't put all my impressions because I think judging a used product that I didn't like could be misguided since it's hard to be certain it's not a condition/defect issue.\n\nUltimately I ended up purchasing the Fiio Ft1, the Dunu DaVinci, and some assorted eartips. Both headphones were in basically new condition. The staff is awesome and showed me every small accessory, down to the last eartip, too prove they were in perfect condition, and reboxed everything for me immaculately. My total was USD$374. Fantastic value. \n\nLeaving with two very popular and common headphones felt a bit comical, given all the variety at my disposal, but I also left feeling like they're popular and common for a reason. I think the IE900 was the one thing I tried that I may save up for and purchase as my next upgrade. I'm still eager to try some DCA closed backs to see how they compete with the Fiio and find out if its worth the upgrade, but I'm not sure the Liric II felt like enough of a jump for me to want to pay that price difference. \n\nSome other random notes/tips about Tokyo:\n\n- They're really into iem cables. There's limited cheap cable options, and a whole lot of expensive ones. I overheard multiple discussions between customers and employees about conductor materials and purity. As someone who doesn't believe in cables upgrading sound, it was a little sad. \n\n- E-Earphones is A+ all around. Staff was great and super helpful. They don't try to sell you on anything and aren't pushy. They also let you try things as long as you'd like. I saw people trying the same headphone for literally hours without being bothered. The used selection is fantastic, and they even seem to do ear molds on the top floor for Ciem's.\n\n- Yodobashi Akiba is a giant and super fun mall to peruse. They have less selection than E- Earphone, but still better than I've seen anywhere else, and they also have everything out to sample. But it's still a mall environment, so there's a lot of distractions and background noise that made it harder to extract great impressions of individual headphones. The staff is less pushy than US stores, but they did come up to me to try to sell me on things unlike E-Earphones.\n\n- E-Earphones buys used gear, which I wish I'd known beforehand. I'd have packed a lot of iem's and things that I'm too lazy to list on Ebay, it would've given me a lot more room to make some new purchases with. \n\nIf you're in Tokyo, and you love headphones, it's definitely worth a visit. Fantastic experience all around. "
        }
      ]
    },
    {
      "cluster": 3,
      "size": 11,
      "top_terms": [
        [
          "amazon",
          0.26224353869409994
        ],
        [
          "atx",
          0.18971423558941827
        ],
        [
          "newegg",
          0.18844511379651682
        ],
        [
          "cpu",
          0.18114431000714828
        ],
        [
          "monitor",
          0.13763576814105183
        ],
        [
          "memory",
          0.12267385155320439
        ],
        [
          "rebates",
          0.12112077315538468
        ],
        [
          "cpu cooler",
          0.12074268765415323
        ],
        [
          "power supply",
          0.12074268765415323
        ],
        [
          "supply",
          0.12074268765415323
        ],
        [
          "cooler",
          0.12074268765415323
        ],
        [
          "motherboard",
          0.11427037129473955
        ],
        [
          "video card",
          0.11245149325178336
        ],
        [
          "video",
          0.1117025924733004
        ],
        [
          "pcpartpicker",
          0.11084789765244725
        ]
      ],
      "representatives": [
        {
          "name": "t1_n2s3xx9",
          "subreddit": "PcBuild",
          "body": "\\[PCPartPicker Part List\\](https://pcpartpicker.com/list/xC4hwY)\n\n\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 5 9600X 3.9 GHz 6-Core Processor\\](https://pcpartpicker.com/product/4r4Zxr/amd-ryzen-5-9600x-39-ghz-6-core-processor-100-100001405wof) | $156.00 @ Amazon \n\n\\*\\*CPU Cooler\\*\\* | \\[Thermalright Burst Assassin 120 SE ARGB 66.17 CFM CPU Cooler\\](https://pcpartpicker.com/product/sysV3C/thermalright-burst-assassin-120-se-argb-6617-cfm-cpu-cooler-ba120-se-argb) | $23.39 @ Amazon \n\n\\*\\*Motherboard\\*\\* | \\[Gigabyte B850 GAMING X WIFI6E ATX AM5 Motherboard\\](https://pcpartpicker.com/product/9xYfrH/gigabyte-b850-gaming-x-wifi6e-atx-am5-motherboard-b850-gaming-x-wifi6e) | $159.99 @ Amazon \n\n\\*\\*Memory\\*\\* | \\[Patriot Viper Venom 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory\\](https://pcpartpicker.com/product/4cCCmG/patriot-viper-venom-32-gb-2-x-16-gb-ddr5-6000-cl30-memory-pvv532g600c30k) | $85.99 @ Newegg \n\n\\*\\*Storage\\*\\* | \\[MSI SPATIUM M461 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive\\](https://pcpartpicker.com/product/9vfxFT/msi-spatium-m461-2-tb-m2-2280-pcie-40-x4-nvme-solid-state-drive-spatium-m461-2tb) | $89.99 @ MSI \n\n\\*\\*Case\\*\\* | \\[Phanteks Eclipse G370A ATX Mid Tower Case\\](https://pcpartpicker.com/product/nBFCmG/phanteks-eclipse-g370a-atx-mid-tower-case-ph-ec370a\\_dbk01) | $56.98 @ Newegg \n\n\\*\\*Power Supply\\*\\* | \\[MSI MAG A750GL PCIE5 750 W 80+ Gold Certified Fully Modular ATX Power Supply\\](https://pcpartpicker.com/product/dbCZxr/msi-mag-a750gl-pcie5-750-w-80-gold-certified-fully-modular-atx-power-supply-mag-a750gl-pcie5) | $79.98 @ Amazon \n\n\\*\\*Monitor\\*\\* | \\[ASRock PG27QFT1B 27.0\" 2560 x 1440 180 Hz Monitor\\](https://pcpartpicker.com/product/LfzXsY/asrock-pg27qft1b-270-2560-x-1440-180-hz-monitor-pg27qft1b) | $142.77 @ Amazon \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | Total (before mail-in rebates) | $805.09\n\n | Mail-in rebates | -$10.00\n\n | \\*\\*Total\\*\\* | \\*\\*$795.09\\*\\*\n\n | Generated by \\[PCPartPicker\\](https://pcpartpicker.com) 2025-07-12 15:51 EDT-0400 |"
        },
        {
          "name": "t1_n20lx70",
          "subreddit": "PcBuild",
          "body": "yeah change everything\n\n\\[PCPartPicker Part List\\](https://pcpartpicker.com/list/pVGfZc)\n\n\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 5 9600X 3.9 GHz 6-Core Processor\\](https://pcpartpicker.com/product/4r4Zxr/amd-ryzen-5-9600x-39-ghz-6-core-processor-100-100001405wof) | $165.00 @ Amazon \n\n\\*\\*CPU Cooler\\*\\* | \\[Thermalright Silver Soul 110 54 CFM CPU Cooler\\](https://pcpartpicker.com/product/Gs4Ycf/thermalright-silver-soul-110-54-cfm-cpu-cooler-ss110-white) | $28.90 @ Amazon \n\n\\*\\*Motherboard\\*\\* | \\[Asus B650E MAX GAMING WIFI W ATX AM5 Motherboard\\](https://pcpartpicker.com/product/QtnXsY/asus-b650e-max-gaming-wifi-w-atx-am5-motherboard-b650e-max-gaming-wifi-w) | $149.99 @ Newegg \n\n\\*\\*Memory\\*\\* | \\[Silicon Power XPOWER Zenith Gaming 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory\\](https://pcpartpicker.com/product/ypRwrH/silicon-power-xpower-zenith-gaming-32-gb-2-x-16-gb-ddr5-6000-cl30-memory-sp032gxlwu60afdg) | $86.97 @ B&H \n\n\\*\\*Storage\\*\\* | \\[Crucial P3 Plus 1 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive\\](https://pcpartpicker.com/product/chzhP6/crucial-p3-plus-1-tb-m2-2280-nvme-solid-state-drive-ct1000p3pssd8) | $56.95 @ iBUYPOWER \n\n\\*\\*Video Card\\*\\* | \\[Sapphire PULSE Radeon RX 9060 XT 16 GB Video Card\\](https://pcpartpicker.com/product/w2WmP6/sapphire-pulse-radeon-rx-9060-xt-16-gb-video-card-11350-03-20g) | $359.99 @ Amazon \n\n\\*\\*Case\\*\\* | \\[NZXT H5 Flow (2024) ATX Mid Tower Case\\](https://pcpartpicker.com/product/WZtLrH/nzxt-h5-flow-2024-atx-mid-tower-case-cc-h52fw-01) | $59.99 @ Amazon \n\n\\*\\*Power Supply\\*\\* | \\[Corsair RM750e (2025) 750 W Fully Modular ATX Power Supply\\](https://pcpartpicker.com/product/q3Nscf/corsair-rm750e-2025-750-w-fully-modular-atx-power-supply-cp-9020292-na) | $99.99 @ Newegg \n\n\\*\\*Monitor\\*\\* | \\[ASRock PG27QFT1B 27.0\" 2560 x 1440 180 Hz Monitor\\](https://pcpartpicker.com/product/LfzXsY/asrock-pg27qft1b-270-2560-x-1440-180-hz-monitor-pg27qft1b) | $142.77 @ Newegg \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | \\*\\*Total\\*\\* | \\*\\*$1150.55\\*\\*\n\n | Generated by \\[PCPartPicker\\](https://pcpartpicker.com) 2025-07-08 13:03 EDT-0400 |"
        },
        {
          "name": "t1_n66s9d2",
          "subreddit": "PcBuild",
          "body": "\\[PCPartPicker Part List\\](https://pcpartpicker.com/list/YJXHgn)\n\n\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 7 7800X3D 4.2 GHz 8-Core Processor\\](https://pcpartpicker.com/product/3hyH99/amd-ryzen-7-7800x3d-42-ghz-8-core-processor-100-100000910wof) | $366.91 @ Amazon \n\n\\*\\*CPU Cooler\\*\\* | \\[Thermalright AQUA ELITE ARGB V4 66.17 CFM Liquid CPU Cooler\\](https://pcpartpicker.com/product/6RVfrH/thermalright-aqua-elite-argb-v4-6617-cfm-liquid-cpu-cooler-aqua-elite-360-argb-v4) | $50.90 @ Amazon \n\n\\*\\*Motherboard\\*\\* | \\[Asus B650E MAX GAMING WIFI W ATX AM5 Motherboard\\](https://pcpartpicker.com/product/QtnXsY/asus-b650e-max-gaming-wifi-w-atx-am5-motherboard-b650e-max-gaming-wifi-w) | $149.99 @ Newegg \n\n\\*\\*Memory\\*\\* | \\[Patriot Viper Venom 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory\\](https://pcpartpicker.com/product/4cCCmG/patriot-viper-venom-32-gb-2-x-16-gb-ddr5-6000-cl30-memory-pvv532g600c30k) | $85.99 @ Amazon \n\n\\*\\*Storage\\*\\* | \\[Crucial P3 Plus 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive\\](https://pcpartpicker.com/product/yGZ9TW/crucial-p3-plus-2-tb-m2-2280-nvme-solid-state-drive-ct2000p3pssd8) | $119.95 @ iBUYPOWER \n\n\\*\\*Video Card\\*\\* | \\[Asus PRIME OC Radeon RX 9070 XT 16 GB Video Card\\](https://pcpartpicker.com/product/WcHp99/asus-prime-oc-radeon-rx-9070-xt-16-gb-video-card-prime-rx9070xt-o16g) | $719.99 @ Amazon \n\n\\*\\*Case\\*\\* | \\[Phanteks Eclipse G370A ATX Mid Tower Case\\](https://pcpartpicker.com/product/nBFCmG/phanteks-eclipse-g370a-atx-mid-tower-case-ph-ec370a\\_dbk01) | $57.98 @ Newegg \n\n\\*\\*Power Supply\\*\\* | \\[SeaSonic CORE GX ATX 3 (2024) 850 W 80+ Gold Certified Fully Modular ATX Power Supply\\](https://pcpartpicker.com/product/t7h2FT/seasonic-core-gx-atx-3-2024-850-w-80-gold-certified-fully-modular-atx-power-supply-core-atx-3-gx-850) | $111.91 @ Newegg \n\n\\*\\*Monitor\\*\\* | \\[ASRock PG27QFT1B 27.0\" 2560 x 1440 180 Hz Monitor\\](https://pcpartpicker.com/product/LfzXsY/asrock-pg27qft1b-270-2560-x-1440-180-hz-monitor-pg27qft1b) | $152.77 @ Amazon \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | Total (before mail-in rebates) | $1826.39\n\n | Mail-in rebates | -$10.00\n\n | \\*\\*Total\\*\\* | \\*\\*$1816.39\\*\\*\n\n | Generated by \\[PCPartPicker\\](https://pcpartpicker.com) 2025-07-31 12:12 EDT-0400 |"
        },
        {
          "name": "t1_n3nnl5n",
          "subreddit": "PcBuild",
          "body": "for that much money get a rtx 5080 system , most important part of gaming pc is gpu\n\n\\[PCPartPicker Part List\\](https://pcpartpicker.com/list/4x2qMC)\n\n\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 7 7800X3D 4.2 GHz 8-Core Processor\\](https://pcpartpicker.com/product/3hyH99/amd-ryzen-7-7800x3d-42-ghz-8-core-processor-100-100000910wof) | $340.05 @ Amazon \n\n\\*\\*CPU Cooler\\*\\* | \\[Thermalright AQUA ELITE ARGB V4 66.17 CFM Liquid CPU Cooler\\](https://pcpartpicker.com/product/6RVfrH/thermalright-aqua-elite-argb-v4-6617-cfm-liquid-cpu-cooler-aqua-elite-360-argb-v4) | $50.90 @ Amazon \n\n\\*\\*Motherboard\\*\\* | \\[Gigabyte X870 GAMING WIFI6 ATX AM5 Motherboard\\](https://pcpartpicker.com/product/n3cgXL/gigabyte-x870-gaming-wifi6-atx-am5-motherboard-x870-gaming-wifi6) | $189.99 @ Amazon \n\n\\*\\*Memory\\*\\* | \\[Patriot Viper Venom 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory\\](https://pcpartpicker.com/product/4cCCmG/patriot-viper-venom-32-gb-2-x-16-gb-ddr5-6000-cl30-memory-pvv532g600c30k) | $85.99 @ Newegg \n\n\\*\\*Storage\\*\\* | \\[Crucial P3 Plus 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive\\](https://pcpartpicker.com/product/yGZ9TW/crucial-p3-plus-2-tb-m2-2280-nvme-solid-state-drive-ct2000p3pssd8) | $113.95 @ iBUYPOWER \n\n\\*\\*Video Card\\*\\* | \\[Asus PRIME GeForce RTX 5080 16 GB Video Card\\](https://pcpartpicker.com/product/q6XMnQ/asus-prime-geforce-rtx-5080-16-gb-video-card-prime-rtx5080-16g) | $1264.99 @ ASUS \n\n\\*\\*Case\\*\\* | \\[Phanteks Eclipse G370A ATX Mid Tower Case\\](https://pcpartpicker.com/product/nBFCmG/phanteks-eclipse-g370a-atx-mid-tower-case-ph-ec370a\\_dbk01) | $56.98 @ Newegg \n\n\\*\\*Power Supply\\*\\* | \\[Super Flower Zillion FG 850 W 80+ Gold Certified Fully Modular ATX Power Supply\\](https://pcpartpicker.com/product/BqYRsY/super-flower-zillion-fg-850-w-80-gold-certified-fully-modular-atx-power-supply-sf-850z12fg) | $109.99 @ Newegg \n\n\\*\\*Monitor\\*\\* | \\[ASRock PG27QFT1B 27.0\" 2560 x 1440 180 Hz Monitor\\](https://pcpartpicker.com/product/LfzXsY/asrock-pg27qft1b-270-2560-x-1440-180-hz-monitor-pg27qft1b) | $152.77 @ Amazon \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | Total (before mail-in rebates) | $2375.61\n\n | Mail-in rebates | -$10.00\n\n | \\*\\*Total\\*\\* | \\*\\*$2365.61\\*\\*\n\n | Generated by \\[PCPartPicker\\](https://pcpartpicker.com) 2025-07-17 12:26 EDT-0400 |"
        },
        {
          "name": "t1_n5v5mri",
          "subreddit": "PcBuild",
          "body": "gpu matters more than cpu\n\n\\[PCPartPicker Part List\\](https://pcpartpicker.com/list/YJXHgn)\n\n\n\nType|Item|Price\n\n:----|:----|:----\n\n\\*\\*CPU\\*\\* | \\[AMD Ryzen 7 7800X3D 4.2 GHz 8-Core Processor\\](https://pcpartpicker.com/product/3hyH99/amd-ryzen-7-7800x3d-42-ghz-8-core-processor-100-100000910wof) | $341.00 @ Amazon \n\n\\*\\*CPU Cooler\\*\\* | \\[Thermalright AQUA ELITE ARGB V4 66.17 CFM Liquid CPU Cooler\\](https://pcpartpicker.com/product/6RVfrH/thermalright-aqua-elite-argb-v4-6617-cfm-liquid-cpu-cooler-aqua-elite-360-argb-v4) | $50.90 @ Amazon \n\n\\*\\*Motherboard\\*\\* | \\[Asus B650E MAX GAMING WIFI W ATX AM5 Motherboard\\](https://pcpartpicker.com/product/QtnXsY/asus-b650e-max-gaming-wifi-w-atx-am5-motherboard-b650e-max-gaming-wifi-w) | $149.99 @ Newegg \n\n\\*\\*Memory\\*\\* | \\[Patriot Viper Venom 32 GB (2 x 16 GB) DDR5-6000 CL30 Memory\\](https://pcpartpicker.com/product/4cCCmG/patriot-viper-venom-32-gb-2-x-16-gb-ddr5-6000-cl30-memory-pvv532g600c30k) | $85.99 @ Newegg \n\n\\*\\*Storage\\*\\* | \\[Crucial P3 Plus 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive\\](https://pcpartpicker.com/product/yGZ9TW/crucial-p3-plus-2-tb-m2-2280-nvme-solid-state-drive-ct2000p3pssd8) | $119.95 @ iBUYPOWER \n\n\\*\\*Video Card\\*\\* | \\[Asus PRIME OC Radeon RX 9070 XT 16 GB Video Card\\](https://pcpartpicker.com/product/WcHp99/asus-prime-oc-radeon-rx-9070-xt-16-gb-video-card-prime-rx9070xt-o16g) | $719.99 @ Amazon \n\n\\*\\*Case\\*\\* | \\[Phanteks Eclipse G370A ATX Mid Tower Case\\](https://pcpartpicker.com/product/nBFCmG/phanteks-eclipse-g370a-atx-mid-tower-case-ph-ec370a\\_dbk01) | $57.98 @ Newegg \n\n\\*\\*Power Supply\\*\\* | \\[SeaSonic CORE GX ATX 3 (2024) 850 W 80+ Gold Certified Fully Modular ATX Power Supply\\](https://pcpartpicker.com/product/t7h2FT/seasonic-core-gx-atx-3-2024-850-w-80-gold-certified-fully-modular-atx-power-supply-core-atx-3-gx-850) | $111.91 @ Newegg \n\n\\*\\*Monitor\\*\\* | \\[ASRock PG27QFT1B 27.0\" 2560 x 1440 180 Hz Monitor\\](https://pcpartpicker.com/product/LfzXsY/asrock-pg27qft1b-270-2560-x-1440-180-hz-monitor-pg27qft1b) | $152.77 @ Amazon \n\n | \\*Prices include shipping, taxes, rebates, and discounts\\* |\n\n | Total (before mail-in rebates) | $1800.48\n\n | Mail-in rebates | -$10.00\n\n | \\*\\*Total\\*\\* | \\*\\*$1790.48\\*\\*\n\n | Generated by \\[PCPartPicker\\](https://pcpartpicker.com) 2025-07-29 17:08 EDT-0400 |"
        }
      ]
    },
    {
      "cluster": 4,
      "size": 30,
      "top_terms": [
        [
          "removed",
          0.570672649591956
        ],
        [
          "pro removed",
          0.12407957581426393
        ],
        [
          "dongle",
          0.07872146469524559
        ],
        [
          "pro",
          0.06208005162297108
        ],
        [
          "mdr removed",
          0.05741444579772743
        ],
        [
          "cable",
          0.054133171413557085
        ],
        [
          "sony mdr",
          0.046469956693203966
        ],
        [
          "mdr",
          0.04246988971327993
        ],
        [
          "dac",
          0.04018630771990986
        ],
        [
          "help",
          0.03868192771704971
        ],
        [
          "sony",
          0.03727353546815421
        ],
        [
          "movies",
          0.03409111854899802
        ],
        [
          "review",
          0.025847941365531757
        ],
        [
          "suggest",
          0.023952639427368045
        ],
        [
          "gaming",
          0.02279948448737841
        ]
      ],
      "representatives": [
        {
          "name": "t3_1lmhi3v",
          "subreddit": "headphones",
          "body": "Fiio FT1\n[removed]"
        },
        {
          "name": "t3_1luqyfc",
          "subreddit": "headphones",
          "body": "Should I get Fiio FT1 or JT1?\n[removed]"
        },
        {
          "name": "t3_1ly1f5c",
          "subreddit": "headphones",
          "body": "AR5000 or FT1?\n[removed]"
        },
        {
          "name": "t3_1lxdg8r",
          "subreddit": "headphones",
          "body": "Fiio FT1 M21 EQ\n[removed]"
        },
        {
          "name": "t3_1me82d5",
          "subreddit": "headphones",
          "body": "HD 560s vs Fiio FT1?\n[removed]"
        }
      ]
    },
    {
      "cluster": 5,
      "size": 108,
      "top_terms": [
        [
          "pro",
          0.20163871683229104
        ],
        [
          "better",
          0.040921569343831614
        ],
        [
          "like",
          0.03312222541097469
        ],
        [
          "sound",
          0.0311897757137759
        ],
        [
          "shp",
          0.031098186539207352
        ],
        [
          "bass",
          0.0265369697328137
        ],
        [
          "edition",
          0.025081870190957884
        ],
        [
          "planar",
          0.023935550827097606
        ],
        [
          "lot",
          0.023789496998840438
        ],
        [
          "non",
          0.02325782686024139
        ],
        [
          "price",
          0.023195679045868636
        ],
        [
          "treble",
          0.02285800295181755
        ],
        [
          "good",
          0.022676043508648467
        ],
        [
          "really",
          0.022623206966176753
        ],
        [
          "headphone",
          0.02205003070777157
        ]
      ],
      "representatives": [
        {
          "name": "t1_n0r5jum",
          "subreddit": "headphones",
          "body": "Why is FT1 Pro horrible? I just want your views on it"
        },
        {
          "name": "t1_n02llwc",
          "subreddit": "headphones",
          "body": "Only the closed-back FT1 is impressive because there's no competition. The rest I found disappointing. FT1 Pro to me was like a less resolving HE4XX with a bit better bass, the FT7 to me is quite overpriced for what you get, and the rest are just straight up garbage."
        },
        {
          "name": "t3_1lx5o0v",
          "subreddit": "headphones",
          "body": "Ali Express message about Fiio Ft1 Pro\nHi, \n\nI got an email that the FT1 Pro I bought off ali express might be infringing on copyright for some unknown reason?  \nI bought the headphones from a random chinese store , and I checked the serial number when they arrived to verify its a Fiio product, and everything is fine. They sound great and theres nothing counterfeit about them. \n\nWhat is that email really about? Im not planning on returning them or saying anything to anyone. Were they illegally distributed?"
        },
        {
          "name": "t1_mvd149e",
          "subreddit": "headphones",
          "body": "Ft1 Pro was probably the single most well rounded of them all in all ways, if I had to pick one I'd go with that, especially for the price loved everything about, Middle ground for bass, comfort, audio quality, although it shined with packaging and accessories and feels premium"
        },
        {
          "name": "t1_n58kjwr",
          "subreddit": "headphones",
          "body": "I'm new to this , my previous one was a marshall major 3 , so idk, I like the look of hd660s2 and the ft1pro has planar drivers so"
        }
      ]
    }
  ]
}