{
  "0": {
    "size": 30,
    "top_words": [
      "neutral",
      "bass",
      "flat",
      "prefer",
      "think",
      "treble",
      "sound",
      "bit",
      "warm",
      "bright"
    ],
    "examples": [
      {
        "id": "t3_1l0ie4n",
        "subreddit": "headphones",
        "text": "Sennheiser IE200 with the 2nd tip position sounds absolutely incredible\nI've owned the Sennheiser IE200 for 3 years but I had never tried the 2nd tip position permitted by the dual tuning feature, because many people said it was a gimmick and unreliable. Today, out of curiosity, I decided to try it out and see if that's actually the case. This is because the 2nd position has less bass and I found the default position to have too much bass. \n\nhttps://preview.redd.it/vv35qtx4d94f1.png?width=1235&format=png&auto=webp&s=533f39925c435262a326dd629053930ec2a3fd99\n\nI discovered that the stock tips can stay in the 2nd position reliably as long as you don't push the IEMs into your ear too hard. I used the stock silicone tips because the foam tips killed the treble and resulted in a veiled sound for me. I used the small size tips because they stayed in the 2nd position most reliably and also had the deepest fit which helped acquire the correct bass response. \n\nAfter switching to the 2nd tip position, the sound opened up massively and became a lot clearer. With the neutral bass and boosted treble, this transforms the IE200 into having a similar sound signature to the HD800S, except the IE200 h"
      },
      {
        "id": "t1_mwhiize",
        "subreddit": "headphones",
        "text": "They very warm and dark, mid focused headphones. Quite far from neutral. The HD600 is much closer to neutral."
      },
      {
        "id": "t1_mwirkzo",
        "subreddit": "headphones",
        "text": "That’s true, I guess I haven’t listened to a ton of truly neutral headphones (only the HD600 and maybe Utopias) long enough. Compared to my Grados and HD620s the HD6XX do sound fairly neutrals."
      },
      {
        "id": "t1_mwisni9",
        "subreddit": "headphones",
        "text": "Still more low end than the apparently very neutral HD600. I’m starting to think my idea of neutral was different from many people’s from the beginning."
      },
      {
        "id": "t1_mxtkpp0",
        "subreddit": "headphones",
        "text": "I vastly prefer the HD800, even though it is fairly different from most headphones. Give it a few minutes before making any judgement, it takes a little bit. For me the HD800's bass is nicely extended and punchy. I might have missed reading this earlier, but have you tried EQing your HD600? I ind it takes to it alright depending on the amp and how loud you listen."
      },
      {
        "id": "t1_myee1ru",
        "subreddit": "headphones",
        "text": "Verum 1, HD600, and NDH30 are the most neutral open-backs I've heard. But none of them is perfectly neutral. There is always something. From what I haven't tried yet, Ollo X1 and HD550 also seem to be very neutral."
      },
      {
        "id": "t1_myfkygu",
        "subreddit": "headphones",
        "text": "Open-back headphone: Sennheiser HD560s.\nThe HD600/650 others have mentioned lack bass and/or are too warm to be considiered neutral.\n\nIEMs: JVC HA-FDX1 or Moondrop Blessing2"
      },
      {
        "id": "t1_mym4y7w",
        "subreddit": "headphones",
        "text": "For sure. And the HD600 everyone keeps recommending is undeniably more neutral by graph."
      },
      {
        "id": "t1_myn7u41",
        "subreddit": "headphones",
        "text": "To me I think just a pair of hd600's would be what you're looking for. Hd800's are very polarizing and much more expensive. Hd600's are kind of the go to for the reference neutral sound."
      },
      {
        "id": "t1_myts76z",
        "subreddit": "headphones",
        "text": "So I own a couple of zmfs, \n\nAuteur classic - hd600 series but better with slightly recessed mids and better bass performance compared to the hd600 series\n\nAuteur og - a less refined version of the auteur classic with a warmer tuning \n\nAtticus - warm warm warm and smooth, amazing bass but very slightly muddy \n\nVerite closed - dynamic and impactful but slightly veiled \n\nVerite open - beautiful mids and sub bass for an open back\n\nAeolus - timbre is elite with suede pads, smooth and warm \n\nBokeh open - more of a neutral offering \n\nBokeh closed - incredible price for performance\n\nCaldera open (I don’t own) super nice tonal balance and smooth treble performance with perf suede pads\n\nAtrium - incredible on tubes, arguably the best zmf for enjoyment due to its impact and ease of listening, not harsh at all.\n\n\nAtrium closed and caldera closed and Eikon I either haven’t tried or can’t remember \n\nSound signature varies heavily with pads"
      }
    ]
  },
  "1": {
    "size": 251,
    "top_words": [
      "headphones",
      "pair",
      "sound",
      "love",
      "use",
      "really",
      "years",
      "audio",
      "good",
      "bought"
    ],
    "examples": [
      {
        "id": "t3_1ljy4dz",
        "subreddit": "BudgetAudiophile",
        "text": "Find a pair of headphones that sound like the HD600 for $50\n[removed]"
      },
      {
        "id": "t3_1l4yusj",
        "subreddit": "headphones",
        "text": "Does anyone use audiophile headphones for retro gaming?\n have a bunch of retro consoles (snes, genesis, saturn, dreamcast etc) hooked to my jvc d series crt. I live in an apartment and game late at night so i can’t play loud, which is what I prefer, so i thought why not get a nice audio/headphone setup going? The crt has weak line level audio out, so plugging a headphone directly in is not gonna be a good experience, so I was thinking about getting maybe a Schiit Vali 3 headphone amp (i like tubes!) to plug into the crt audio out, and then a nice pair of audiophile headphones like the Sennheiser hd600s? Anyone here have a setup like this for playing retro games? How is it?"
      },
      {
        "id": "t3_1l5edoe",
        "subreddit": "headphones",
        "text": "Desktop DAC+AMP For PC & HD600s\nI've been using an ASUS Xonar Essence sound card forever with my HD650s, and honestly, I’ve never had any real complaints. It’s always sounded good to me.\n\nThat said, I just ordered a fresh pair of HD600s, and it's got me wondering:  \n**Am I leaving performance on the table by not upgrading to a dedicated DAC/amp setup?**\n\nWould love to hear from others who’ve made the jump or who are running HD600s on different setups. Also open to **DAC/amp recommendations** (all-in-one or stack) that pair well with the HD600s. This will be for my desktop PC setup."
      },
      {
        "id": "t3_1l7cxo6",
        "subreddit": "headphones",
        "text": "My HD600s sound really quiet for some reason!! Is there a way to install an internal amp\n"
      },
      {
        "id": "t3_1l7o7y2",
        "subreddit": "headphones",
        "text": "Did my HD600'S come broken?\nEver since i upgraded from the AKG K701 i began to hear crackling and distortion in many songs that i listen a lot to, and i began to wonder if my headphones are damaged or maybe it's just the songs. I made a tonal sweep which was completly clean but im not sure it this is the be all end all test"
      },
      {
        "id": "t3_1l8sgr4",
        "subreddit": "headphones",
        "text": "Dumb thoughts - scratch on new shokz openrun pro 2 minis\nJust bought one! Scratched out of the box. Works a charm though. Surprised at the sound quality for what it is. Intended use case will be while cycling to work or working alone (I still need to hear my surroundings any for my job).\n\nAnyways, the out of the box scratch is bothering the heck out of me. I used it briefly to mess with the app/EQ and have a listen. Then put it away.\n\nDon't get me wrong, I hate dinging up my more expensive collection of headphones (HD600, DT880 etc) but if I scratch them and it's on me, I'll take a day or two to accept it and move on knowing my cans now have Abit more character.\n\nAn out of box scratch, just feels like I got cheated.\n\nThe store I bought from has a silly policy of no exchanges for headphones once the box is open, claiming hygiene reasons. I don't know if they'll do it for my shokz given the out of the box scratch.\n\nDoes anyone reckon I can get them to exchange for a brand new unscuffed one?\n\nI'm from Australia if that helps! So maybe I can claim consumer law."
      },
      {
        "id": "t3_1lavg05",
        "subreddit": "headphones",
        "text": "Deciding between 2 headphones\nHi! I am no headphone enthusiast. I got my first pair of Sennheiser HD600’s about 6 years ago and they have been amazing. It honestly changed my perspective on headphones and listening to music. It’s crazy clear, and I’m not looking for an upgrade per se? (But if recommendations are there it’d be lovely), but a pair of more close back or noise cancelling headphones. \n\nI play FPS games like Valorant, so I want headphones that will help me hear sound cues better. Primarily, I study though so music and audio quality that will immerse me is imperative too. \n\nI link my mic and headphones up to an audio interface, so I’m trying to decide between \nDT990’s vs DT770 pro’s. I heard one is open back and one is close back but I’m curious on any more recommendations out there, or if I should even get another open back when I already have one that’s open and that I’m 100% still happy with, and will continue using. \n\nCurious on close back now tbh, but any reccos or info is good. Thanks! "
      },
      {
        "id": "t3_1ldk278",
        "subreddit": "headphones",
        "text": "Getting my first set: K7 BT + HD600. Some questions..\n[removed]"
      },
      {
        "id": "t3_1ldulq8",
        "subreddit": "headphones",
        "text": "The btr7 and hd6xx fit perfectly in this case.\nI was going through my pictures and saw this. I used this case before I modded my headphones. I didn’t cut anything. It just so happened that this case designed for the hd600 series perfectly fit the btr7. \n\nMy hd6xx look nothing like this now and I bought a different case that suits it new shape. I’ve switched to the btr17 as well. \n\nThey don’t fit as snugly as this. I miss the sense of order that came with this case. \n\n"
      },
      {
        "id": "t3_1ljp5il",
        "subreddit": "headphones",
        "text": "Driver failure on the Sennheiser HD600 part 3\nSome of you might remember my previous two posts about driver failures on my HD600. After the second time it happened, the consensus was that my amp was most likely at fault since this issue is quite rare and highly unlikely to happen twice under regular use. So I got rid of it, plugged the headphone directly into my PC, and thought I was done.  Well, guess what... It's been a few months, and the left side is gone again. How the hell is this even possible?  Since this is the third time having the same issue within the warranty period, I should be able to get a refund, but I'm not sure what to do next. At this point, I really don't trust these anymore (even though I absolutely love the sound), so I was thinking about switching to something else with a similar sound profile. Would a DT 990 Pro be a suitable replacement?  "
      }
    ]
  },
  "2": {
    "size": 70,
    "top_words": [
      "cable",
      "comfortable",
      "time",
      "balanced",
      "balanced cable",
      "different",
      "unit",
      "fully",
      "closed",
      "auto webp"
    ],
    "examples": [
      {
        "id": "t3_1l7squ2",
        "subreddit": "headphones",
        "text": "Portable Setup ft. Ol' mate senny\nThe HD and IE six hungeos complement each other really well, and are pretty light for long sessions anywhere. \nHD600 modded with Capra strap and ZMF pads for comfort and longevity. \nIE600 use Penon Liqueur Orange Tips.\nDongle is Jcally JM20 MAX for the huge power output. "
      },
      {
        "id": "t3_1l94668",
        "subreddit": "headphones",
        "text": "did anyone change their cable on their hd600 series headphones?\ndid it add anything for you? \n\ni am getting an openheart balanced 16 core silver upgrade cable for my 660s 2 quite soon since i simply wanted a nicer looking cable"
      },
      {
        "id": "t3_1lm85io",
        "subreddit": "headphones",
        "text": "Pulled the trigger...\nAfter some time, I decided to buy the Sennheiser HD 660S2 over the HD600, as my very first high-end and most expensive audio gear so far... Man what a blast I am having with it!, sounds amazing and specially for metal music... It's incredible!. Just a bit down that it doesn't have a proper case, but I think it's worth. \n\nStill would like to try the HD600 sometime in the future. Does anyone know any good case for travel or carry to commute? I use a DAP, and works phenomenal with the 4.4 balanced cable."
      },
      {
        "id": "t3_1lnyggw",
        "subreddit": "headphones",
        "text": "Waifu came home, Tago x Moondrop T3-01-MD\nhttps://preview.redd.it/97hlhr9grz9f1.jpg?width=4032&format=pjpg&auto=webp&s=604f584a57465d3f1344bf4d1f8c343ec3ad19cf\n\nYes, I am a weeb. Yes, I fell for their weeb marketing.\n\nAnyway.\n\nTo put it briefly, this is like a Japanese refinement of the legendary HD6x0. The sound signature is neutral, with forward vocals, warm and full mid-bass, and smooth, pleasant treble presentation.\n\nWith the stock (single-ended) cable, the sound has a slightly trailing / diffuse feeling similar to an HD650 paired with a tube amp. Vocals are sweet and smooth. The soundstage is airy and open, not as in-your-face as the 6x0 line, and wider than the 560S / 550 / 505. The slightly echoey bass gives an impression of a grander, more expansive stage. Even when driven by the Qudelix 5K, the T3-01-MD retains a sweet, tube-like character. This is currently my go-to portable setup when I'm away from home.  \n  \nWith Moondrop's balanced cable, the sound becomes tighter and more centered. Bass gains more punch and definition, vocal forwardness is similar to the HD600, and layering and detail separation get a boost. With good desktop amps such as Xduoo TA-32 or Topping A90/D9"
      },
      {
        "id": "t1_mveaw3w",
        "subreddit": "headphones",
        "text": "Ive listend to 400k accuphase stuff, 100% is 2% away from HD600s"
      },
      {
        "id": "t1_mved6ga",
        "subreddit": "headphones",
        "text": "it can survive fall but I rpobably don't toss it, I'm more comfortable on throwing hd600 though."
      },
      {
        "id": "t1_mvnup36",
        "subreddit": "headphones",
        "text": "You absolutely don't need a balanced cable to run the HD600, that K7 has way more than enough power.\n\nSave your money and try Equalizer APO or other EQ if you want to ACTUALLY add more bass, for f r e e.\n\nAs someone who tried and owns a fair share of headphones, I'm telling you the HD600 are 90% there with the best of the best."
      },
      {
        "id": "t1_mvoppim",
        "subreddit": "headphones",
        "text": "I want an HD800 but at the same time I can't leave my hd600 behind"
      },
      {
        "id": "t1_mvvjef9",
        "subreddit": "headphones",
        "text": "I've seen plenty of complains on HD650 cable which is a different one, haven't seen complains on HD600 cable really, but I'm spending time mostly on HeadphoneAdvice and not here."
      },
      {
        "id": "t1_mwb9mg8",
        "subreddit": "headphones",
        "text": "can confirm, drives my hd600 with balanced cable with ease"
      }
    ]
  },
  "3": {
    "size": 132,
    "top_words": [
      "bass",
      "pro",
      "good",
      "sound",
      "sounds",
      "treble",
      "headphones",
      "better",
      "soundstage",
      "arya"
    ],
    "examples": [
      {
        "id": "t3_1l0gr0r",
        "subreddit": "headphones",
        "text": "Heard the new FiiO FT7 and FiiO i5 planar headphones - Here are my impressions\nVisited Bay Bloor Radio in Toronto today and got a chance to hear the new FiiO FT7 ($700 USD) and Fosi Audio i5 ($550) planars. Here's some quick impressions.\n\n1. Heard the Fosi i5 first. Comfy, looks like a Susvara. At first glance the bass is pretty good. It's elevated with a good amount of body and heft. Midrange has a vocal forwardness to it which some people might like. There's a sizable midtreble peak somewhere that's fairly prominent and brings sibilance. Not intolerable for me, but pretty close to being too much. It's less intensely sharp/harsh than some of the HiFiMan peaks can be. Decent staging, feels fairly open.\n\n2. Heard the FiiO FT7 next. It's also pretty comfy. It's a much more neutral sounding set. The midrange sounds a little pulled back. No real issues with the treble, it's pretty tame though there's probably some minor peak somewhere. Bass isn't shy, but it's nothing special. Soundstage is a bit more on the intimate side. Resolution does come across as being clean, but it's not a set that I'd say is noticeably resolving. It's one of those headphones where I don't really have too much "
      },
      {
        "id": "t3_1lbxewg",
        "subreddit": "headphones",
        "text": "Edition XS with ifi Zen DAC + maybe Zen CAN\nI recently bought the Edition XS and since I've red that my Shiit Magni/Modi Stack should be sufficient I didn't upgrade them. Now that I've listened quite a bit to the Edition XS, I was missing a lot of bass, it definitely didnt have more bass than my HD600 I used before. So I tried the Headphones on my Speaker Amp which has a headphone amp as well and there it was, all the bass I've missed before.\n\nNow I'm eyeing the ifi Zen DAC and maybe CAN as well. But I'm not sure if maybe the DAC alone would be enough. I'm told that the Edition XS does not need that much power but the Schiits don't seem to deliver enough.\n\nAnyone here who has tried this combination?"
      },
      {
        "id": "t3_1lfivoi",
        "subreddit": "headphones",
        "text": "Audiologists, engineers, and headphone geeks. Please help my pain with Arya Stealth!\nLong story I really hope someone can help.\n\nI have an SMSL DO400, fed by a Wiim Ultra.\n\nDaily drivers were SHP9500. No problems but looked for an upgrade. I tried Fostex T50RP Mk3 and T60 Argons and they gave me significant ear pain - hyperacuisis. I put this down to a peak between 2.5 and 3.5k or so as SHP9500 have a much lower peak at this frequency.\n\nTried bosoting this frequency in EQ and instant agony.\n\nTried EQing Fostex down but never really worked.\n\nTried Sennheiser HD600/6XX but the clamp force was horrific so never really gave them a chance.\n\nHave been looking for some end game cans, made myself some DIY Borealis - seemed ok.\n\nThen Spied some FIIO FT1s. No particular treble peak around 3k - IMMEDIATE ear pain.\n\nWow I decide my ear pain is caused by CLOSED backs and the extra pressure they generate - hence pain with the FT1 and the Fostex (which are essentially closed). Never any pain with any IEM or earbuds reinforces this - the pressure they generate is miniscule, even though they are sealed in.\n\nReading a lot I decide Arya Stealth are what I need nice and open. IMMEDIATE EAR PAIN!\n\nI EQ"
      },
      {
        "id": "t3_1lfnsaj",
        "subreddit": "headphones",
        "text": "The ANC Headphone journey of a deranged audio enjoyer\n# In 2020, I was given my first pair of ANC headphones at work: the Sony WH-1000XM3. I was blown away by what Active Noise Cancellation could do on flights. Since then, I've been hunting for the perfect pair of Active Noise Cancelling headphones with my extremely nitpicky attitude, but thus far it's been a struggle.\n\nJust to preface, my home-listening needs are completely covered by my admittedly excessive wired headphone collection, so ANC headphones are something I only use on flights and in hotel rooms or alike. Here are the ANC headphones I've tried and my general thoughts on them. \n\n# Sony WH-1000XM3\n\nI really enjoyed them. The comfort was good and ANC was excellent (as a first timer). I can't remember exactly how the ANC compares to newer models, but I do recall that their passive seal worked really well with my ears. Because of that, I thought the XM4 and XM5 were actually a downgrade in ANC.\n\nI gave this pair away after work upgraded me to the XM4. So I haven’t heard them since getting invested in audio, but based on the frequency response, I have a strong feeling I’d be less positive about their sound now.\n\n# Sony WH-10"
      },
      {
        "id": "t3_1lgk3mr",
        "subreddit": "headphones",
        "text": "Went from HD600 Dreams to Sundaras + Fiio K5 Pro—Anyone Else Running This Setup?\n[deleted]"
      },
      {
        "id": "t3_1liy39z",
        "subreddit": "headphones",
        "text": "Sennheiser HD600 vs HD660S2 First Impressions\nI'm very much an ameteur when it comes to being an audiophile, but I decided to give these two Sennheiser models a shot. I've only owned the Sony WH-1000XM3 and now the XM6s before this, so it was a completely blind purchase that was backed by Amazon's generous return policy.\n\nI opened the HD600 first. I played some of my favorite tracks, and I was blown away by the clarity of the trebles and mids, admiring the extraordinary soundstage present in these headphones. Truly exhilarating. However, when it came to evaluating the bass, especially listening to my favorite bass drops or guitar solos, I found these headphones to be lacking. Sure, it is probably the correct and true amount of bass, but it lacked something I want to call *character*. It was so clinical and soulless with the bass, that it wiped the smile off my face caused by listening to the ethereal vocals. Taking this impression, I opened up the HD660S2.\n\nFor this one, I immediately noticed the \"warmth\" everyone referred to regarding these headphones. As opposed to the clinical bright light that one might compare the 600s to, these definitely had a sound closer to an old yellow k"
      },
      {
        "id": "t3_1llgkh6",
        "subreddit": "headphones",
        "text": "Need help with choosing headphones\nI made a post recently asking about my problem with Edition xs, i am very sensitive to treble and turns out some people like me find them sibliant, even describing the pain at sound \"s\". I tried EQ and it didnt help, even lowest volume sounds like a glass to my ears, and while i like the soundstage and clarity of them, the good bass, they are literally unusable for me, i developed a tinnitus and pain in my ears from just few sessions with them. I paired them with fiio k7. Before that i was only ever using sennheiser iems IE200, and always found their sound perfect, i could listen to great volume with no problem.\n\nNow i want to get again an open back pair that can work for me considering my sensitivity to high frequency, i dont want them to sound muddy, but definitely warm, i want same soundstage and detail. The budget, 250 would be great, but i could go to up around 500 i think. From what i read i saw options like\n\nFiio ft1 pro\nFiio ft5\nHD600\nHD660s2\nMeze 109 pro\nAudeze lcd-2\n\nEach of these pairs cost higher than the previous one, and i dont want to pay too much for like 10% quality increase in sound. Could you give me a feedback back on these mod"
      },
      {
        "id": "t3_1lmlfzm",
        "subreddit": "headphones",
        "text": "Hd600 insanity\nI have to say ik drunk out of my mind just bought my Dover also pissed to hell and beyond I’ve had my seinheisers for about a year a couple days ago a friend ent me their focus right amp and something about eh quite increase is mental it’s keeping me up every night just listening to music in my pc idk what to do I think this sounds better than if i went to see these srtinstd live im so I shock the sounds stage everything I can’t describe how all the small things come together "
      },
      {
        "id": "t3_1lowmgp",
        "subreddit": "headphones",
        "text": "Guys... I think I'm finished!\nI've tried a lot of gear and i'm loving this setup and stable of headphones like no other. I'm done. I'm not buying anything else unless something breaks.\n\n(left to right) HD600, HD800, Sony MDR M1, Modhouse T60 Argon\n\nRME Babyface Pro FS > RME ADI 2 Pro FS > Xduuo TA66"
      },
      {
        "id": "t3_1lweaut",
        "subreddit": "headphones",
        "text": "Grell Audio OAE1 Review\n# The OAE1 Deserves Your Attention \n\nNote: This is a shorter version of my review  [Pragmatic Audio](https://www.pragmaticaudio.com/reviews/2025/07/grell-audio-oae1/)\n\nThe OAE1 is probably the most polarizing headphone I've ever reviewed. It's tuned completely differently from anything else on the market, using extreme angled drivers and \"free field\" tuning instead of traditional \"diffuse field\" approaches. After 6 weeks of extensive listening, I think it's genuinely innovative - but definitely not for everyone.\n\n# The Backstory: \"Think Different\" Meets Audio Science\n\nAfter spending many evenings listening too and thinking about the OAE1, two thoughts kept coming to mind from my computer industry background:\n\n1. **Steve Jobs' \"Think Different\" campaign** \\- This headphone challenges conventional headphone tuning in the same way Mac challenged Windows PCs\n2. **The Gartner Hype Cycle** \\- The OAE1's launch perfectly mirrors this: initial buzz → inflated expectations → backlash → and now, hopefully, a more balanced understanding\n\nThe truth is somewhere between the hype and the hate. Like Mac vs PC, this will always be a headphone that people either love or hate"
      }
    ]
  },
  "4": {
    "size": 28,
    "top_words": [
      "pads",
      "zmf",
      "stock",
      "change",
      "new",
      "ear",
      "years",
      "ear pads",
      "original",
      "new pads"
    ],
    "examples": [
      {
        "id": "t3_1ls6f4u",
        "subreddit": "headphones",
        "text": "Brand new HD600 and worn in HD600 Impression\nI had HD600 for a little over 3 years now. But my father recently got his HD600, so I thought I would compare those two and see if I can hear the difference.\n\nBrand new HD600 obviously has brand new ear pads, and mine has worn in 3 years old ear pads. Note that it’s not too worn in or anything.\n\nThe first 10 minutes’ impression of sound is that old pads make music more dynamic. And new pads make music more dull and dry in comparison. Mind that the difference I’m describing is subtle but noticeable in a back-to-back comparison setting.\n\nThe biggest difference to me was the vocal range in both male and female vocals across the genre. Vocals sound more intimate and strong and almost more dynamic in old pads. In new pads, vocals are a little far away or set back and slightly thin in comparison, which made it sound analytical and chilled down. \n\nThis difference in vocal also affected the sound stage. New pads gave me the impression of a wider sound stage, whereas in old pads, every element was more intimate. \n\nI initially expected old pads to have better bass because that’s what I heard from other people and made total sense to me. But what I"
      },
      {
        "id": "t3_1m5l9km",
        "subreddit": "headphones",
        "text": "Horizon Arrived, they fit in the Geekria case I bought. ♪(´▽｀)\nI was going to wait until I had listened more until posting, but thought some other newbies like me might have ordered these, and I have some useful tips so decided to just do a quick post.\n\n\n\n# Case\n\nI ordered a Geekria Large headphone case (Black: EJB35-01) from amazon during Prime Day to keep them in so they don't get dusty, and after I shifted the bumpy foam inside the case so it squeezes in towards the top instead of the bottom, they just fit with the cables still inserted oh boy am I happy about that. once you zip the case closed it holds them down with the lid against the foam to keep them secure just like in the box they arrived in. one thing though I am going to put them in facing up everytime because I feel like the inserted cables clear a bit better and I feel better about their durability.\n\nAlso I didn't know until I opened it but the black case (EJB35-01) has a smooth outer shell, which I feel like will show marks easier and more sticky to dust/eventual mold. So if I knew this I would have gotten the Grey one (EJB35-03) instead because I can see in the images it clearly has the fabric on the outside. I have"
      },
      {
        "id": "t3_1m96jdc",
        "subreddit": "headphones",
        "text": "Horizon with Square Opening Pads (the effect is positive, but not what I expected)\nThe Square opening pads I ordered from Aliexpress arrived.\n\nSorry I do not have a rig to measure the differences, so this will be subjective take only. But I really did try my best by listening to particularly music with sub bass first, changing the pads, then listening to the same tracks straight after.\n\nThe stock pads are hybrid Sheepskin? outer and felt inner where it touches your head. The new Aliexpress pads are All Sheepskin with square opening. Both are sheepskin perforated on the inner inner ring.\n\nFirst tactile impression: the all Sheepskin square opening pads fit on the metal rings perfectly and feel more comfortable on the skin. Just slightly more plush and I found the stock felt inner was slightly itchy feeling sometimes. They feel slightly grippier, but not by much because of the light clamp force. I was expecting some kind of night and day difference in terms of isolation but this wasn't any different. Open back things I guess.\n\n**So my TLDR opinion:** I was expecting the all Sheepskin pads to seal better, and therefore improve the deep bass. But after listening for 30 mins on all the s"
      },
      {
        "id": "t1_mvnywf0",
        "subreddit": "headphones",
        "text": "Hd600s - 22 years old. Replaced pads/cable. Still going strong. Produced a _lot_ of music with them. \n\n\nI love them"
      },
      {
        "id": "t1_mvs044l",
        "subreddit": "headphones",
        "text": "My HD600 was bought in 1999. I still use it almost daily. Still sounds great, only maintenance I've had to do was a cable swap and a couple sets of new pads"
      },
      {
        "id": "t1_mw51rgh",
        "subreddit": "headphones",
        "text": "Dude, same boat for me and my HD600s! Just bought new ear pads and head band after having them for like 10 years!"
      },
      {
        "id": "t1_mwazosx",
        "subreddit": "headphones",
        "text": "The HD600s do not have synthetic leather ear pads."
      },
      {
        "id": "t1_mwblo3u",
        "subreddit": "headphones",
        "text": "do NOT buy this type of stands for the HD600. The pads already wear out relatively quickly from just wearing them semi frequently. And worn out pads do affect the sound noticably. Instead of having to buy pads ever 1-3 years it'll be 6 months"
      },
      {
        "id": "t1_mwf335s",
        "subreddit": "headphones",
        "text": "My hd600 and hd650 are not stock though! Both have after market pads ( zmf and yaxi respectively ) and have the copper mods done."
      },
      {
        "id": "t1_myjyncw",
        "subreddit": "headphones",
        "text": "HD600 has lasted me through COVID since 2019. Only had to change pads. Grilles have some rust too. But all of that can be fixed easily and cheaply. \n\nMDR-Z7 has been an oldie but goodie for me too."
      }
    ]
  },
  "5": {
    "size": 52,
    "top_words": [
      "dac",
      "need",
      "impedance",
      "loud",
      "drive",
      "volume",
      "high",
      "know",
      "maybe",
      "output"
    ],
    "examples": [
      {
        "id": "t3_1lfzjnk",
        "subreddit": "BudgetAudiophile",
        "text": "SMSL C200 Pro Review\n\n# Exceptional Transparency and Power in a extremely Compact and Pragmatic-priced Package\n\n> Note: this is a slightly cut-down version of my review I originally posted on \n[my blog](https://www.pragmaticaudio.com) but I thought it might be interesting to the budget audiophile community.\n\nSMSL makes an incredible number of impressive DAC and amplifiers in every price range, so does the C200 Pro \ncontinue this trend? A common trend with SMSL is to incrementally update different product lines of products with the \nlatest chips, so from a specification perspective, the C200 Pro represents a nice incremental upgrade over the previous very \nimpressive C200. \n\nHopefully, in this review, I will give you an idea of the upgrades over the C200 but also for newcomers to SMSL \nheadphone DAC amplifiers what you can expect. \n\n![marketing1.jpg](https://www.pragmaticaudio.com/reviews/2025/06/smsl-c200-pro/marketing1.jpg)\n\n> I would like to thank Aoshida Audio for providing the C200 Pro for this review. But they have not influnced this review in anyway. \n\n> If you are interested in finding more information about this product, you can find it at this non-affiliate link:\n[C200 Pro"
      },
      {
        "id": "t3_1m59wc9",
        "subreddit": "BudgetAudiophile",
        "text": "JEF Q Concerto Meta vs ELAC UniFi UBR62 in the near-field\nI am wondering if any one have tried both and have some thoughts about which would fare better, when used at about a 1m distance from listener, and 0.6m from the wall? I will be using a Wiim Vibelink Amp connected to a Holo Cyan 2 DAC through RCA. \n\nThe KEF Q Concerto Metas were well received by Erin, but leans a bit dark with a rolled off high-end, and frankly cheap looking finishes. The ELAC UniFi UBR62s were also well received at the time, but most of the reviews are several years old, so I fear it might not be competitive against the newer stuff. \n\nDemoing is not an option where I live (and used market is drier than my hands), so I'm kind of at a disadvantage on that front. I also don't have much experience with good speakers, though I have loads with headphones (my favorites are ZMF Atrium Open, HD600, HD800). \n\nI don't expect any one to come barging in with a definitive answer to which is \"better\", since I know how subjective audio is, and how room variations and listening distances can have a profound effect. But any thoughts and experiences would be greatly appreciated!"
      },
      {
        "id": "t3_1m67fu6",
        "subreddit": "BudgetAudiophile",
        "text": "JBL 305P MkII noise when using GPU - May need DAC/amp with Optical Input\nHeadphones: Sennheiser HD600\nSpeakers: JBL 305P MkII, connected with Hosa CPR-201 Dual 1/4\" TS to RCA cables\nMotherboard: MSI MAG X870 TOMAHAWK (S/PDIF output)\nDAC/Amp: Monoprice Desktop Amp/DAC, connected to PC via USB (https://drop.com/buy/monoprice-desktop-amp-dac)\n\nI’m aware that some noise is typical with these speakers but during gaming the noise is noticeable. This wasn’t a problem when using the same speakers and DAC/Amp with my previous Alienware R10 PC. However, after switching to a custom-built PC I’ve started experiencing the same issue reported here (https://www.reddit.com/r/BudgetAudiophile/comments/17t0dvj/jbl_305p_mk_ii_noise_out_of_dac/) I'm assuming using an optical cable will fix this for me too but that requires me buying a new DAC/amp to even test it.\n\nI’d like to avoid purchasing a new DAC/Amp since mine has performed fine until now but I’m open to it if necessary. I'm looking for alternatives or DAC/amp recommendations with optical input. \n\n"
      },
      {
        "id": "t3_1lbe8sq",
        "subreddit": "headphones",
        "text": "Will dac/amp make a huge difference?\n Hey, im interested in the audiophile hobby but don't have any good equipment, so im planning on dropping 400 on the Meze 105 Aer. Coming from shp9500 (eqed to hd600) and kph30i with grado pads, im expecting at least a difference in sound. But i thought connecting directly into my laptop (msi gf65 9sd thin) would be good enough,until i found out it may need an external dac/amp. But does the dac/amp actually make a huge difference with the 105s?"
      },
      {
        "id": "t3_1lns1or",
        "subreddit": "headphones",
        "text": "External noise effects on driver quality/performance etc. What happens?\nSorry if this question has an obvious answer but basically im wondering if its possible to damage the drivers of say an open back pair of head pahones by playing music really loudly next to them. For example, if you put some HD600s right next to very loud speakers playing music for many many hours, what would happen. Would they be fine? Would they break completely? would they only be 5% screwed? Considering the loudspeaker makes noise in basically the same way as the headphones, would it do anything? "
      },
      {
        "id": "t3_1lns848",
        "subreddit": "headphones",
        "text": "Really loud loudspeakers up against headphones.\nSorry if this question has an obvious answer but basically im wondering if its possible to damage the drivers of say an open back pair of head pahones by playing music really loudly next to them. For example, if you put some HD600s right next to very loud speakers playing music for many many hours, what would happen. Would they be fine? Would they break completely? would they only be 5% screwed? Considering the loudspeaker makes noise in basically the same way as the headphones, would it do anything?"
      },
      {
        "id": "t3_1lznix1",
        "subreddit": "headphones",
        "text": "Ka3 + Hd600 volume control\n[removed]"
      },
      {
        "id": "t3_1m22pq2",
        "subreddit": "headphones",
        "text": "Best EQ for HD600 ? Oluv's one ?\nHi there,  \nI've read Oluv made decent eqs for HD600. I'm getting a brand new pair this week. I don't know if it's still up to date but can someone provide me a download link to these so I can make my own tests ? (I couldn't find it, my bad probably)  \n  \nor maybe there's a better EQ file out there I should check out ? Please send your recommendations and thank you for your help :)"
      },
      {
        "id": "t3_1m3wppd",
        "subreddit": "headphones",
        "text": "The Venerable DO400 - Seamlessly Powerful, beautiful, and feature rich\n# SMSL DO400 Review - A Powerful, Feature-Rich Balanced DAC/Amplifier\n\nNote: This is a cut down version of my full review over at [Pragmatic Audio](https://www.pragmaticaudio.com/reviews/2025/07/smsl-do400/)\n\n> I would like to thank AOSHIDA Audio for providing the SMSL DO400 for the purposes of this review.\n>\n> If you are interested in finding more information about this product, you can find it at via this non-affliated link: SMSL DO400 at AOSHIDA Audio\n>\n> It typically retails for $499 but I believe there is a sale on now and it can be got for $459.\n\n# Introduction\n\nThe SMSL DO400 has been on the market for more than 18 months, making it a battle-tested veteran in the fast-moving headphone amplifier industry. While many competitors have come and gone, the quality of this amplifier has made it a standout. The DO400 expanded SMSL's lineup with a proper high-end look combined with top-performing DACs and a very high-powered amp, making it a formidable all-in-one device that remains relevant today.\n\nAt its core, the DO400 delivers a clean, neutral, and extremely powerful amplification. There are cheaper amplifiers"
      },
      {
        "id": "t3_1m92xgd",
        "subreddit": "headphones",
        "text": "Need amp louder than ifi zen can\nHi I'm running a hd600 with a audient id4 mkii (I know maybe not top shelf) and got the hd600, on the spec sheet it says the audient has enough output but imo I need more.\n\nFor context I'm a bedroom player, signal chain wise its my guitar - Friedman IR X(preamp pedal, has line out) - audient - logic -out to ifi - hd600\n\nSo I got a ifi zen can studio and it got louder.. but still could use a but more volume. Level very close from hitting 0, I set the line in at -1 for mqximum volume without clipping. Can't have it set higher.\n\nIts not that I have trouble hearing or anything but when I compate the HD600 to the shure 840a it defo could use a bit more power at the cost of my hearing. \n\nProbably my mistake of rushing this without enough research. I assumed the ifi would be enough. I could use some extra 6 db, so it gotta be very loud.\n\nSo yeah, recs for louder amps appreciated. Thanks"
      }
    ]
  },
  "6": {
    "size": 43,
    "top_words": [
      "headphone",
      "better",
      "cheaper",
      "sounding",
      "lcd",
      "bass",
      "think",
      "natural",
      "sound",
      "make"
    ],
    "examples": [
      {
        "id": "t3_1l4o907",
        "subreddit": "headphones",
        "text": "Does this headphone stand stretch the headphones too much?\nHi, I got the HD600s and want to buy a headphone stand but this looks like it’s kind of wide. Can anybody help or recommend a similar looking stand? Maybe this isn’t a problem at all but I personally don’t understand why a headphone stand would CONSTANTLY stretch the headphones 🥸 \nThx"
      },
      {
        "id": "t3_1l6xyh9",
        "subreddit": "headphones",
        "text": "Which is better HD600 or DT990(250ohm) for EDM/Funk/Lo-Fi mixing & mastering\n[removed]"
      },
      {
        "id": "t3_1m1qpcf",
        "subreddit": "headphones",
        "text": "Looking for Audiophile Headphone Suggestions (HD600 or Alternatives with Better Bass?)\n[removed]"
      },
      {
        "id": "t3_1m49c7r",
        "subreddit": "headphones",
        "text": "This is why Hybrid driver headphone does not work, Final Audio Sonorous IV\nThis is the Second Episode of my weird and forgotten headphone review, this time it is on the Final Audio Sonorous IV, this is a headphone I really wanted to like, with its novelty being a dual driver headphone that uses a Dynamic driver and BA driver to deliver a rich and detailed audio performance, but in reality this thing is just that a novelty and gimmick, this thing have a treble peak so big it makes Beyer dynamics headphone sounded smooth, the treble peak makes Grados sound like HD600 in comparison. \n\nCheck out this video and my other video on the Senneheiser HD558. \n\nhave a good day everyone"
      },
      {
        "id": "t3_1mj5fkg",
        "subreddit": "headphones",
        "text": "Guess the headphone\nThis is (potentially) my new end game (for now). It out resolves whatever I currently have (Arya v3, LCD 2F, HD600) and just slightly behind Susvara in terms of outright of resolving capabilities. "
      },
      {
        "id": "t1_mvtzz4v",
        "subreddit": "headphones",
        "text": "Find a pair of Sennheiser HD600's. Based on your replies, what I'm seeing is that you want a more detailed and less muddy/boomy headphone. The Fiios are great headphones for the price, but they are not the headphone for you."
      },
      {
        "id": "t1_mw3rsas",
        "subreddit": "headphones",
        "text": "You heard right I have hd600 and the 600 series have insane amount of shoutynes problem and no one talks about it or regret it because they think the hd600 one of the most natural headphone (they not)"
      },
      {
        "id": "t1_mwf557n",
        "subreddit": "headphones",
        "text": "I love them. Very neutral, very clean, and sound great with a tube amp. I don't have the HD600 just because I cant justify having both, but from a quick audition of the HD600 they are very, very similar. Some differences in bass response and I think the 6XX has better soundstage while the 600 is slightly better as far as imaging, but the 6XX is quite a bit cheaper."
      },
      {
        "id": "t1_mwl5k4z",
        "subreddit": "headphones",
        "text": "Even the m40x was better, 58x was way better, hd6xx, hd600, various IEMs, Edition XS all better. Other probably-better things: HE400se, ath r50x.\nIf you coincidentally like their house sound then that's fine, but for mixing and mastering they're not very ideal. If your goal isn't accuracy and moreso just fun, can't knock you for your preference. Also, plenty of these headphones are better after EQ, including any beyers, but they tend to have absurd sibilance and unnatural bloated bass/low mids, so it's more work to get something good out of them"
      },
      {
        "id": "t1_mwrflgi",
        "subreddit": "headphones",
        "text": "For sure, I always thought it was dumb how there's an HD600 and HD650 and how much people argue about them given how similar they are (and how, like you mention, you get instances of one actually sounding like the other). \n\nAfter reading what you said, I'm starting to think they may have done this because tolerances were so lax 25 years ago that they basically had enough of a variance to make 2 different models and label it as a \"revision\" lol"
      }
    ]
  }
}